/* Generated localization file */

"\n\n请重新打开终端，或执行 `source ~/.zshrc`，让 launcher 生效。" = "\n\nPlease reopen the terminal, or run `source ~/.zshrc` to activate the launcher.";
"\n                1. 画布点 LCD 屏幕 → Inspector 显示「修改」\n                2. 点「修改」进入编辑态（接管 BLE）\n                3. 选择你的图片（动图推荐 ≤200 帧、≤2MB），可先在虚拟屏幕里预览\n                4. 确认后点底部「写入键盘」统一写入设备\n                " = "\n                1. Tap the LCD screen on the canvas → the Inspector shows Edit\n                2. Tap Edit to enter editing mode (taking over BLE)\n                3. Choose your image (animation recommended ≤200 frames, ≤2 MB); preview it on the virtual screen first\n                4. After confirming, tap Write to Keyboard at the bottom to write everything to the device\n                ";
"\n                Mode 1 → claude_0.gif（出厂内置）\n                Mode 2 → cursor.gif\n                Mode 3 → codex.gif\n                Mode 4 → 预留/自定义\n\n                首次连接键盘且发现某个 Mode 的 flash slot 为空时，主 App 会自动把对应 bundle 图片推到键盘上。\n                " = "\n                Mode 1 → claude_0.gif (built-in)\n                Mode 2 → cursor.gif\n                Mode 3 → codex.gif\n                Mode 4 → reserved / custom\n\n                On first connection, if the main app finds a Mode flash slot empty, it automatically pushes the corresponding bundled image to the keyboard.\n                ";
"\n                • macOS 原生转写：在地化语言识别，识别完 ⌘V 写回光标。适合任何输入框\n                • Fn/Globe：用于 Typeless、微信语音、豆包输入法，在对应软件内把快捷键设为 Fn/Globe\n                • 自定义快捷键：只写入键盘，不接管为固定语音预设\n                • AhaType：先识别再优化提示词（需登录）\n                " = "\n                • macOS Native Transcription: localized speech recognition, then paste at the cursor with ⌘V. Works in any input field\n                • Fn/Globe: for Typeless, WeChat Voice, and Doubao IME; set the shortcut to Fn/Globe in the corresponding app\n                • Custom Shortcut: written to the keyboard only, not taken over as a fixed voice preset\n                • AhaType: transcribe first, then optimize the prompt (requires login)\n                ";
"\n                • 主 App（你正在用的）— 看配置、改键位、上传 LCD 图片、查诊断\n                • Agent 守护进程 — 后台常驻；监听 IDE 的 Hook（Claude / Cursor / Codex / Kimi），并在 BLE 上向键盘转发当前任务状态\n                • 键盘固件 — 收到 BLE 状态后驱动灯条颜色、LCD 显示、按键映射\n                " = "\n                • Main App (the one you are using) — view config, remap keys, upload LCD images, check diagnostics\n                • Agent daemon — runs in the background; listens to IDE hooks (Claude / Cursor / Codex / Kimi) and forwards the current task state to the keyboard over BLE\n                • Keyboard firmware — drives light bar colors, LCD display, and key mappings based on the received BLE state\n                ";
"\n                • 检查右上角是否「已连接」\n                • 切到正在用的 Mode\n                • 触发一次工具调用让 Hook 真的发 0x90 给键盘\n                • 如果是手动批准档 + Mode 1：preToolUse 是蓝、其他状态是红\n                " = "\n                • Check whether the top-right shows Connected\n                • Switch to the Mode you are using\n                • Trigger a tool call so the hook actually sends 0x90 to the keyboard\n                • If in Manual approval + Mode 1: preToolUse is blue, other states are red\n                ";
"\n                • 短按（Toggle）：第一次按开始，第二次按结束 — 适合长段话\n                • 长按（Hold-to-speak）：按住时录音，松开停 — 适合微信、豆包等需要\"按住\"的输入法\n\n                两种模式在 Key 1 Inspector 的「触发方式」Tab 里切换。\n                " = "\n                • Short press (Toggle): first press starts, second press stops — good for long passages\n                • Long press (Hold-to-speak): hold to record, release to stop — good for WeChat, Doubao, and other IMEs that require \"holding\"\n\n                Switch between the two modes in the Trigger Mode tab of the Key 1 Inspector.\n                ";
"\n                • 绿色「✓ 已上传 N 帧」：键盘 flash 真有 N 帧（你或自动同步推的）\n                • 灰色「未上传」：键盘 flash 空，正显示固件默认或留空\n                • 没有徽章：还没自占 BLE 查到（点过一次「修改」就有了）\n                " = "\n                • Green \"✓ N frames uploaded\": the keyboard flash actually contains N frames (pushed by you or auto-sync)\n                • Gray \"Not uploaded\": the keyboard flash is empty, showing the firmware default or blank\n                • No badge: not yet queried while owning BLE (appears after tapping Edit once)\n                ";
"\n                • 自动批准（switchState=0）：Hook 拦截每次工具调用 / 命令请求时直接放行\n                • 手动批准（switchState=1）：Hook 把决定交回终端，由你手动按 Key2/Key3 通过或拒绝\n                " = "\n                • Auto approval (switchState=0): the hook lets every tool call / command request pass directly\n                • Manual approval (switchState=1): the hook returns the decision to the terminal; press Key2/Key3 to approve or reject manually\n                ";
"\n                • 蓝牙：连接键盘必须\n                • 麦克风：苹果原生转写、AhaType、按住说话所有语音功能都需要\n                • 输入监控：捕获语音键的按下/松开事件\n                • 辅助功能：模拟键盘按键（用于 ⌘V 写回文本、注入 Fn/Globe 等）\n                • 语音识别：苹果原生转写\n                • Siri 与听写（macOS 13+）：原生转写依赖项\n                " = "\n                • Bluetooth: required to connect the keyboard\n                • Microphone: required for native macOS transcription, AhaType, and all hold-to-speak voice features\n                • Input Monitoring: captures voice key press/release events\n                • Accessibility: simulates keystrokes (used for ⌘V paste, Fn/Globe injection, etc.)\n                • Speech Recognition: native macOS transcription\n                • Siri & Dictation (macOS 13+): dependencies of native transcription\n                ";
"\n                同一时刻只有一个进程能持有键盘的 BLE 连接：\n                • 默认 Agent 占用 → Hook 状态实时上键盘、自动批准链可用\n                • 你在画布点「修改」时 → 主 App 临时接管，能上传 LCD 图片、改键位、读图片元信息\n                • 点「返回」 → 主 App 释放，Agent 自动接回\n                " = "\n                Only one process can hold the keyboard BLE connection at a time:\n                • By default the Agent occupies it → Hook states reach the keyboard in real time and the auto-approval chain is available\n                • When you tap Edit on the canvas → the main app temporarily takes over to upload LCD images, remap keys, and read image metadata\n                • Tap Back → the main app releases and the Agent reconnects automatically\n                ";
"\n                当拨杆 = auto (switchState=0) 时，固件把部分 state 强制改成彩虹效果：\n                • PreToolUse / PermissionRequest → 整条彩虹波浪\n                • PostToolUse / UserPromptSubmit → 单点彩虹流水\n                这就是你看到「Cursor 一跑灯条变彩虹」的原因——是 auto 档的视觉提示，不是 Cursor 专属。\n                " = "\n                When the switch is in auto (switchState=0), the firmware forces some states to rainbow effects:\n                • PreToolUse / PermissionRequest → full rainbow wave\n                • PostToolUse / UserPromptSubmit → single-dot rainbow flow\n                That is why the light bar turns rainbow when Cursor runs — it is an auto-mode visual hint, not Cursor-specific.\n                ";
"\n                打开「权限诊断」可以看到 Agent 自检结果：\n                • LaunchAgent 已注册：login item 装好\n                • 进程在跑：launchd 拉起了 ahakeyconfig-agent\n                • Hook 已配置：Claude/Cursor/Codex/Kimi 的 .json / settings 都加好了 ahakey-hook 引用\n                " = "\n                Open Permission Diagnostics to see the Agent self-check results:\n                • LaunchAgent registered: login item installed\n                • Process running: launchd has launched ahakeyconfig-agent\n                • Hooks configured: Claude/Cursor/Codex/Kimi .json / settings all include the ahakey-hook reference\n                ";
"\n                按这顺序排查：\n                1. Agent 在跑吗？打开「权限诊断」看\n                2. Agent 是否占着蓝牙？画布顶部应显示已连接，且不在编辑态\n                3. 拨杆在 auto 档？看顶部状态栏；不是的话点画布拨杆切到 auto\n                4. IDE 的 Hook 文件配了吗？「权限诊断」会列出 Claude/Cursor/Codex/Kimi 各自的 Hook 安装状态\n                5. 装完后是否重启过 IDE？尤其 Kimi 安装/升级后必须完全关闭再重开\n                " = "\n                Troubleshoot in this order:\n                1. Is the Agent running? Check Permission Diagnostics\n                2. Does the Agent own Bluetooth? The top of the canvas should show connected and not be in editing mode\n                3. Is the switch in auto? Check the top status bar; if not, tap the canvas switch to switch to auto\n                4. Are the IDE hook files configured? Permission Diagnostics lists the hook installation status for Claude/Cursor/Codex/Kimi\n                5. Did you restart the IDE after installation? Especially for Kimi, you must fully close and reopen after install or upgrade\n                ";
"\n                最新固件中 0x91 已用于灯效预览。虚拟拨杆只作为 Hook 软件覆盖，不再写入键盘 sw_state。\n                " = "\n                In the latest firmware, 0x91 is used for lighting preview. The virtual switch is only a Hook software override and is no longer written to keyboard sw_state.\n                ";
"\n                点完元件 → Inspector 显示「修改」按钮。点「修改」会接管 BLE 进入编辑态；改完点「写入键盘」写入配置，点「返回」退出编辑。\n                " = "\n                Tap a component → the Inspector shows the Edit button. Tap Edit to take over BLE and enter editing mode; after editing, tap Write to Keyboard to write the config, then Back to exit editing.\n                ";
"\n                自动同步只在主 App 自占 BLE 时才查图片元信息。流程：\n                1. 至少点一次「修改」让主 App 接管 BLE\n                2. 四个 Mode 的 0x83 查询完成后才会触发\n                3. 只对 flash 为空（picLength=0）的 Mode 生效\n                4. 如果你曾经手动改过 Inspector 里的「上传图片」路径，自动同步会跳过那个 Mode（不覆盖你的选择）\n                " = "\n                Auto-sync only queries image metadata when the main app owns BLE. Flow:\n                1. Tap Edit at least once so the main app takes over BLE\n                2. Triggered only after all four Mode 0x83 queries complete\n                3. Only applies to Modes whose flash is empty (picLength=0)\n                4. If you have manually changed the Upload Image path in the Inspector, auto-sync skips that Mode (it does not overwrite your choice)\n                ";
"\n                规划中，下一版本会做。当前所有固件升级都需要 USB-ISP（拆机短 BOOT + wchisp）。详细方案在仓库 docs 里。\n                " = "\n                Planned for a future release. All current firmware upgrades require USB-ISP (short BOOT + wchisp). See the docs folder in the repository for details.\n                ";
"\n            Kimi Hooks 已写入 ~/.kimi/config.toml。\n\n            **AhaKey 拨杆接管也已部署**：\n            - 配置层：`~/.kimi-code/config.toml` 的 `default_permission_mode` 会随拨杆同步，决定**新启动**的 Kimi 会话默认权限。\n            - Launcher 层：`~/.ahakey/bin/kimi` 会在新会话启动时根据拨杆自动注入 `--yolo`（自动档）或不注入（手动档）。\n\n            如果 kimi 当前已经打开，请**完全关闭并重新打开一次**，新会话才会生效。正在运行的会话不受影响；如需实时切换当前会话，请手动输入 `/yolo on` 或 `/yolo off`。\n            以后若你**升级了 kimi-cli**，再次点击一次「安装 Kimi Hooks」即可把 launcher 补回去。\n\n            安装完成。Hooks 为 Beta，行为以官方文档为准。\n            " = "\n            Kimi Hooks written to ~/.kimi/config.toml.\n\n            **AhaKey switch takeover also deployed**:\n            - Config layer: `default_permission_mode` in ~/.kimi-code/config.toml syncs with the switch, setting the default permission for **newly launched** Kimi sessions.\n            - Launcher layer: ~/.ahakey/bin/kimi automatically injects `--yolo` (auto mode) or not (manual mode) when a new session starts, depending on the switch.\n\n            If kimi is currently open, please **fully close and reopen it once** for the new session to take effect. Running sessions are not affected; to switch the current session in real time, type `/yolo on` or `/yolo off` manually.\n            If you **upgrade kimi-cli** later, click Install Kimi Hooks again to restore the launcher.\n\n            Installation complete. Hooks are beta; behavior is subject to the official documentation.\n            ";
"\n请立即退出 AhaKey Studio 并重新启动，按系统提示重新勾选权限即可。" = "\nPlease quit AhaKey Studio now and restart, then re-grant permissions as prompted by the system.";
" IPS · 160×80 · RGB565 · 内置 16 Mbit Flash 存帧" = " IPS · 160×80 · RGB565 · Built-in 16 Mbit Flash frame buffer";
" IPS 显示；可上传图片（160×80, RGB565）。" = " IPS display; upload images (160×80, RGB565).";
" · 有效期 %@" = " · Valid until %@";
"%.2f 元" = "%.2f CNY";
"%@ 图片预览" = "%@ Image Preview";
"%@ 已恢复默认值，等待同步。" = "%@ restored to defaults, waiting to sync.";
"%@ 激活失败: %@" = "%@ activation failed: %@";
"%@ 默认动图自动同步失败: %@" = "Auto-sync of %@ default animation failed: %@";
"%@ 默认图片自动同步失败: %@" = "Auto-sync of %@ default image failed: %@";
"%d FPS" = "%d FPS";
"%d dBm" = "%d dBm";
"%d 帧" = "%d frames";
"%d 步 · %d / 98 字节" = "%d steps · %d / 98 bytes";
"%d%%" = "%d%%";
"%d/4 已授权" = "%d/4 authorized";
"%d分钟" = "%d min";
"%d小时" = "%d h";
"%d小时%d分钟" = "%d h %d min";
"%d（覆盖中）" = "%d (overriding)";
"(无日志)" = "(No logs)";
"))权限。请先在系统设置里打开后，再按一次语音键。" = ")) permission. Please enable it in System Settings, then press the voice key again.";
", response.cmd)) 成功" = ", response.cmd)) succeeded";
"0 通知" = "0 Notifications";
"0.96\" IPS · 160×80 · RGB565 · 内置 16 Mbit Flash 存帧" = "0.96\" IPS · 160×80 · RGB565 · Built-in 16 Mbit Flash frame buffer";
"0.96\" IPS 显示；可上传图片（160×80, RGB565）。" = "0.96\" IPS display; upload images (160×80, RGB565).";
"0x2050FF (蓝)" = "0x2050FF (Blue)";
"0xF02029 (红)" = "0xF02029 (Red)";
"1 等待授权" = "1 Awaiting Authorization";
"1. 点「现在申请权限」，按系统弹窗允许蓝牙、麦克风和语音转写。" = "1. Tap \"Request Permissions Now\" and allow Bluetooth, Microphone, and Speech Recognition in the system prompt.";
"1. 点击虚拟键盘对应按键选中它。" = "1. Tap the corresponding key on the virtual keyboard to select it.";
"2 工具完毕" = "2 Tools Done";
"2. 自动打开系统设置后，依次开启 Siri、听写、辅助功能。" = "2. After System Settings opens automatically, turn on Siri, Dictation, and Accessibility.";
"2. 语音键先选预设；其他键按需选单键或宏。" = "2. Choose a preset for the voice key; set other keys to single keys or macros as needed.";
"3 工具执行" = "3 Tool Execution";
"3 灯一组左右扫描。" = "3 lights scan left/right as one group.";
"3. 最后开启输入监控；系统提示重启时退出并重新打开。" = "3. Finally, enable Input Monitoring; quit and reopen when the system prompts to restart.";
"3. 配置完成后点「写入键盘」同步到键盘。" = "3. After configuration, tap \"Write to Keyboard\" to sync.";
"30 天" = "30 Days";
"365 天" = "365 Days";
"4 会话开始" = "4 Session Start";
"4. 切模式时 LCD 先显示描述，再回到该模式动图。" = "4. When switching modes, the LCD first shows the description, then returns to that mode's animation.";
"4. 切模式时 LCD 先显示描述，再回到该模式图片。" = "4. When switching modes, the LCD first shows the description, then returns to that mode's image.";
"4. 回到这里点「我已完成，重新检查」继续体验输入。" = "4. Return here and tap \"Done, Recheck\" to continue trying input.";
"5 停止" = "5 Stop";
"6 任务完成" = "6 Task Complete";
"7 用户提交" = "7 User Submit";
"8 会话结束" = "8 Session End";
"8 颗 WS2812B，颜色由固件 update_claude_ws2812() 决定，1:1 还原在画布上" = "8 WS2812B LEDs; colors determined by firmware update_claude_ws2812(), rendered 1:1 on canvas";
"90 天" = "90 Days";
"Agent 健康检查" = "Agent Health Check";
"Agent 就绪时 Claude/Cursor/Codex 可随拨杆走批准。**Kimi**：安装过 AhaKey Kimi Hooks 后，拨杆会直接接管当前会话；若刚装完或刚升级 kimi-cli，重开一次 kimi 即可。" = "When the Agent is ready, Claude/Cursor/Codex approvals follow the switch. **Kimi**: after installing AhaKey Kimi Hooks, the switch takes over the current session directly; if you just installed or upgraded kimi-cli, reopen kimi once.";
"Agent 已安装，正在准备控制" = "Agent installed, preparing control";
"Agent 已运行。附注：launchctl 输出 — load：%@ start：%@" = "Agent is running. Note: launchctl output — load: %@ start: %@";
"Agent 已连接蓝牙" = "Agent connected to keyboard";
"Agent 未安装" = "Agent not installed";
"Agent 未运行" = "Agent not running";
"Agent 正在控制键盘" = "Agent is controlling keyboard";
"Agent 端覆盖" = "Agent-Side Override";
"Agent 运行中（BLE 未连接）" = "Agent running (BLE not connected)";
"Agent 运行中，等待键盘连接" = "Agent running, waiting for keyboard connection";
"AhaKey Studio 使用 F19 作为 Fn 触发键，并在后台把语音键的按下/松开转换成 Fn/Globe，便于接入微信语音。" = "AhaKey Studio uses F19 as the Fn trigger and converts voice key press/release to Fn/Globe in the background for WeChat voice integration.";
"AhaKey Studio 帮助中心" = "AhaKey Studio Help Center";
"AhaKey Studio 是 AhaKey 小键盘的 macOS 配置中心" = "AhaKey Studio is the macOS configuration center for the AhaKey mini keyboard";
"AhaKey Studio 正在连接键盘" = "AhaKey Studio is connecting to keyboard";
"AhaKey Studio 正在配置键盘" = "AhaKey Studio is configuring keyboard";
"AhaKey Studio 现在会在你使用 编程工具时自动阻止 Mac 进入空闲休眠；macOS 14+ 还支持合盖后继续运行。可在顶部状态栏或「更多」里调整。" = "AhaKey Studio now automatically prevents your Mac from idle sleeping while using coding tools; macOS 14+ also keeps running after closing the lid. Adjust in the top status bar or the More menu.";
"AhaKey Studio 现在会在你使用编程工具时自动阻止 Mac 进入空闲休眠；macOS 14+ 还支持合盖后继续运行。可在顶部状态栏或「更多」里调整。" = "AhaKey Studio now automatically prevents your Mac from idle sleeping while using coding tools; macOS 14+ also keeps running after closing the lid. Adjust in the top status bar or the More menu.";
"AhaKey Studio 等待连接键盘" = "AhaKey Studio waiting for keyboard connection";
"AhaKey Studio 首次使用需要完成几项系统授权：连接键盘需要蓝牙，后台接管语音键需要输入监控与辅助功能，macOS 原生语音需要麦克风、语音转写、Siri 与听写。" = "First launch of AhaKey Studio requires several system permissions: Bluetooth to connect the keyboard, Input Monitoring and Accessibility for background voice key takeover, and Microphone, Speech Recognition, Siri, and Dictation for macOS native voice.";
"AhaKey 安全警告" = "AhaKey Security Warning";
"AhaKey 拨杆接管中：当前为{mode_label}。" = "AhaKey switch takeover: currently {mode_label}.";
"AhaType 云端地址无效，直接写入原始转写。" = "AhaType cloud address invalid; writing raw transcript directly.";
"AhaType 云端整理" = "AhaType Cloud Refinement";
"AhaType 关闭" = "AhaType Off";
"AhaType 处理失败，已写入原始转写。" = "AhaType processing failed; raw transcript written.";
"AhaType 处理失败：%@" = "AhaType processing failed: %@";
"AhaType 已开启，但尚未登录。" = "AhaType is on but not logged in.";
"AhaType 已开启，但登录已过期。" = "AhaType is on but login has expired.";
"AhaType 已开启，语音结果会先经云端整理。" = "AhaType is on; voice results will be refined in the cloud first.";
"AhaType 已整理并写入：%@" = "AhaType optimized and wrote: %@";
"AhaType 已整理，准备粘贴。" = "AhaType refined, ready to paste.";
"AhaType 开启" = "AhaType On";
"AhaType 整理中" = "AhaType Refining";
"AhaType 整理中…" = "AhaType Refining…";
"AhaType 未启用。" = "AhaType not enabled.";
"AhaType 未启用，直接写入原始转写。" = "AhaType not enabled; writing raw transcript directly.";
"AhaType 未注册登录" = "AhaType Not Logged In";
"AhaType 状态" = "AhaType Status";
"AhaType 登录已过期，直接写入原始转写。" = "AhaType login expired; writing raw transcript directly.";
"AhaType 缺少登录令牌，直接写入原始转写。" = "AhaType missing login token; writing raw transcript directly.";
"AhaType 网络错误，已写入原始转写。" = "AhaType network error; raw transcript written.";
"AhaType 请求失败（HTTP %d），已写入原始转写。" = "AhaType request failed (HTTP %d); raw transcription written.";
"AhaType 返回空文本，已写入原始转写。" = "AhaType returned empty text; raw transcript written.";
"AhaType 返回缺少 data，已写入原始转写。" = "AhaType response missing data; raw transcript written.";
"AhaType 返回非 JSON，已写入原始转写。" = "AhaType returned non-JSON; raw transcript written.";
"AhaType 配置写入失败。" = "AhaType configuration write failed.";
"Auto 档的彩虹覆盖" = "Auto-mode rainbow override";
"BLE 占用是一道单行道" = "BLE occupancy is one-way";
"BLE 数据通道还没准备好。" = "BLE data channel is not ready yet.";
"BLE 未连接" = "BLE not connected";
"BLE 连接状态" = "BLE Connection Status";
"Breathing" = "Breathing";
"CGVirtualDisplay 创建失败" = "CGVirtualDisplay creation failed";
"Claude / Cursor / Codex / Kimi Hook 已配置" = "Claude / Cursor / Codex / Kimi Hook configured";
"Claude / Cursor / Codex：按各自确认链。Kimi：若已安装 AhaKey Kimi Hooks，手动档会直接把当前会话拉回手动批准。" = "Claude / Cursor / Codex: follow their own confirmation chains. Kimi: if AhaKey Kimi Hooks are installed, Manual mode pulls the current session back to manual approval.";
"Claude Code · 终端权限 Y/N" = "Claude Code · Terminal permission Y/N";
"Claude Code · 终端权限菜单 Y/N。" = "Claude Code · Terminal permission menu Y/N.";
"Claude Hooks 已写入 ~/.claude/settings.json。" = "Claude Hooks written to ~/.claude/settings.json.";
"Claude Hooks：无法写入 %@。请检查该文件或父目录的权限/只读状态。" = "Claude Hooks: unable to write %@. Check permissions or read-only status of the file or parent directory.";
"Claude Hooks：未找到 ~/.claude/settings.json，已跳过。使用 Claude Code 并生成该文件后，可再点「安装 Claude Hooks」。" = "Claude Hooks: ~/.claude/settings.json not found, skipped. After using Claude Code and generating that file, you can tap \"Install Claude Hooks\" again.";
"Claude hooks 中 ahakey 条目已移除" = "ahakey entry removed from Claude hooks";
"Claude hooks 已写入 ahakeyconfig-agent hook 子命令" = "Claude hooks written to ahakeyconfig-agent hook subcommand";
"Claude/Cursor/Codex/Kimi Hook、灯条状态、拨杆查询" = "Claude/Cursor/Codex/Kimi Hook, light bar status, switch query";
"Claude：PermissionRequest allow。Cursor：preToolUse 等与 cli-config。Codex：PermissionRequest allow。Kimi：安装过 AhaKey Kimi Hooks 后，**拨杆会直接接管当前会话的自动批准**；若刚装完或刚升级 kimi-cli，请**完全关闭并重新打开一次 kimi**。钩子 stdout 只对 **`permissionDecision: deny`** 有特殊拦截语义。Agent 须在跑且蓝牙由其占用。" = "Claude: PermissionRequest allow. Cursor: preToolUse etc. with cli-config. Codex: PermissionRequest allow. Kimi: after installing AhaKey Kimi Hooks, **the switch directly takes over auto-approval for the current session**; if you just installed or upgraded kimi-cli, please **fully close and reopen kimi once**. Hook stdout only has special interception semantics for **`permissionDecision: deny`**. Agent must be running and occupying Bluetooth.";
"Codex Hooks 已写入 ~/.codex/config.toml。\n\n%@\n\n安装完成。请重启 Codex 终端或客户端后再使用。" = "Codex Hooks written to ~/.codex/config.toml.\n\n%@\n\nInstallation complete. Restart the Codex terminal or client before use.";
"Codex Hooks 已写入 ~/.codex/config.toml。\n\n安装完成。请重启 Codex 终端或客户端后再使用。" = "Codex Hooks written to ~/.codex/config.toml.\n\nInstallation complete. Please restart the Codex terminal or client before using.";
"Codex Hooks：已尝试写入 %@，但校验时未发现 AhaKey 标记块。请确认对「用户主目录 /.codex」有写权限，或关闭占用该文件的其它程序。" = "Codex Hooks: attempted to write %@ but the AhaKey marker block was not found during verification. Confirm write access to ~/.codex or close other programs using this file.";
"Codex Hooks：无法写入 %@：%@" = "Codex Hooks: unable to write %@: %@";
"Codex Hooks：无法创建目录 %@：%@" = "Codex Hooks: unable to create directory %@: %@";
"Codex hooks 中 AhaKey 标记块已移除" = "AhaKey marker block removed from Codex hooks";
"Codex hooks 已写入 ~/.codex/config.toml" = "Codex hooks written to ~/.codex/config.toml";
"Codex · 审批 ↵ / Esc。" = "Codex · Approve ↵ / Esc.";
"Cursor Hooks 已写入 ~/.cursor/hooks.json。" = "Cursor Hooks written to ~/.cursor/hooks.json.";
"Cursor Hooks：无法写入 %@。请检查权限或磁盘空间。" = "Cursor Hooks: unable to write %@. Check permissions or disk space.";
"Cursor Hooks：无法创建目录 %@：%@" = "Cursor Hooks: unable to create directory %@: %@";
"Cursor hooks 已写入" = "Cursor hooks written";
"Cursor · ↵ 接受改动 / ⌫ 拒绝改动。" = "Cursor · ↵ Accept changes / ⌫ Reject changes.";
"Cursor · ⌘↵ 接受改动 / ⌘⌫ 拒绝改动。" = "Cursor · ⌘↵ Accept changes / ⌘⌫ Reject changes.";
"EchoWrite 推荐" = "EchoWrite Recommended";
"EchoWrite 推荐：Key1 发送 F18 触发随声写录音，Key2/4 确认，Key3 取消。" = "EchoWrite recommendation: Key1 sends F18 to trigger EchoWrite recording, Key2/4 confirm, Key3 cancels.";
"Fn F19 兼容" = "Fn F19 Compatible";
"Fn 语音输入法" = "Fn Voice Input Method";
"Hook 拦不住，还是会停下来问我" = "Hook can't stop it; still pauses to ask me";
"Hook 的 auto-approve 立即切换到你选的档位。持久化到 UserDefaults，agent 重启仍生效" = "Hook auto-approve switches immediately to your selected gear. Persisted to UserDefaults, survives agent restart";
"IDE「Not in allowlist」用 ~/.cursor/permissions.json 的 terminalAllowlist，与 userCliConfig（cli-config=CLI）分离；见 cursor.com/docs/reference/permissions" = "For IDE \"Not in allowlist\", use terminalAllowlist in ~/.cursor/permissions.json, separate from userCliConfig (cli-config=CLI); see cursor.com/docs/reference/permissions";
"Key %d 设置" = "Key %d Settings";
"Key 1 / 语音键" = "Key 1 / Voice key";
"Key 2 / 通过键" = "Key 2 / Accept key";
"Key 3 / 拒绝键" = "Key 3 / Reject key";
"Key 4 / 删除键" = "Key 4 / Delete key";
"Kimi Hooks：无法写入 %@：%@" = "Kimi Hooks: unable to write %@: %@";
"Kimi Hooks：无法创建目录 %@：%@" = "Kimi Hooks: unable to create directory %@: %@";
"Kimi hooks 中 AhaKey 标记块与旧版裸 hook 已移除" = "AhaKey marker block and legacy bare hook removed from Kimi hooks";
"Kimi hooks 已写入 ~/.kimi/config.toml" = "Kimi hooks written to ~/.kimi/config.toml";
"Kimi：若已安装 AhaKey Kimi Hooks，自动档会直接接管当前会话批准；若刚装完或刚升级 kimi-cli，请先重开一次 kimi。Claude/Cursor/Codex 仍走各自钩子。" = "Kimi: if AhaKey Kimi Hooks are installed, Auto mode directly takes over approval for the current session; if you just installed or upgraded kimi-cli, please reopen kimi once. Claude/Cursor/Codex still use their own hooks.";
"L1: 系统断言" = "L1: System Assertion";
"L2: IORegistry" = "L2: IORegistry";
"L3 禁用电量" = "L3 Disable Battery";
"L3: 虚拟显示器" = "L3: Virtual Display";
"LCD 屏幕" = "LCD Screen";
"LCD 自动同步没触发" = "LCD auto-sync not triggered";
"LCD 角标的含义" = "LCD Badge Meanings";
"LED 测试" = "LED Test";
"LED 状态同步 · Hook 联动" = "LED Status Sync · Hook Linkage";
"LED 跟随 IDE 状态" = "LED Follow IDE State";
"LaunchAgent 已安装" = "LaunchAgent Installed";
"LaunchAgent 的 plist 已保存，但 launchctl load 失败，守护进程未载入。\n\nlaunchctl 输出：\n%@\n\n常见原因：同一 Label 已存在、plist 无效、对 ~/Library/LaunchAgents 无写权限。可先点「卸载」再装，或在「控制台」搜索 %@。" = "LaunchAgent plist saved, but launchctl load failed and the daemon was not loaded.\n\nlaunchctl output:\n%@\n\nCommon causes: duplicate Label, invalid plist, or no write permission for ~/Library/LaunchAgents. Try Unload then install again, or search %@ in Console.";
"Mode 1 / Mode 2 时，固件的 update_claude_ws2812() 直接 return，**灯条不再随 IDE state 变**，会停在上一次设定的颜色上。这是固件设计，不是 bug。" = "In Mode 1 / Mode 2, firmware update_claude_ws2812() returns directly, **the light bar no longer follows IDE state** and stays at the last set color. This is by firmware design, not a bug.";
"Mode 1 默认文案：Record / Accept / Reject / Backspace" = "Mode 1 default labels: Record / Accept / Reject / Backspace";
"OFF (熄灭)" = "OFF (Off)";
"OLED 上传中" = "OLED Upload";
"OTA 升级有吗？" = "Is there an OTA update?";
"Off" = "Off";
"PreToolUse — 工具开始执行（manual 档专属）" = "PreToolUse — Tool starting execution (Manual mode only)";
"SessionEnd — Claude 会话结束" = "SessionEnd — Claude session ended";
"Siri" = "Siri";
"Solid" = "Solid";
"Typeless / 微信语音 / 豆包输入法使用 F19 触发，并注入 Fn 按住/松开。" = "Typeless / WeChat Voice / Doubao IME use F19 trigger, injecting Fn hold/release.";
"ahakeyconfig-agent 主日志" = "ahakeyconfig-agent Main Log";
"auto 批准 vs manual 批准；详见「虚拟拨杆」章节。" = "Auto approval vs manual approval; see the \"Virtual Switch\" section.";
"custom · 自定义模式" = "custom · Custom Mode";
"event tap create failed (缺辅助功能或输入监控权限?)" = "event tap create failed (missing Accessibility or Input Monitoring permission?)";
"hooks.json 中无「hooks」或为空，没有可移除的 AhaKey 项。" = "No \"hooks\" in hooks.json or it is empty; no AhaKey items to remove.";
"kimi-cli 读 default_yolo 在 KimiCLI.create/load_config；已开着的会话请输入 /reload 即可（不必退出 kimi）。PreToolUse 仍仅 deny 会拦工具；default_yolo 管交互批准层。" = "kimi-cli reads default_yolo in KimiCLI.create/load_config; for open sessions, just type /reload (no need to quit kimi). PreToolUse still only denies tools; default_yolo manages the interactive approval layer.";
"launchctl load 已执行。若数秒后未显示「运行中」，请点「查看日志」。" = "launchctl load executed. If \"Running\" does not appear after a few seconds, tap \"View Logs\".";
"macOS 原生语音" = "macOS Native Voice";
"macOS 原生语音走 F18；Fn / Globe 触发走 F19" = "macOS native voice uses F18; Fn / Globe trigger uses F19";
"macOS 原生语音默认 F18；Typeless / 微信的 Fn 触发使用 F19。" = "macOS native voice defaults to F18; Typeless / WeChat Fn trigger uses F19.";
"macOS 原生转写" = "macOS Native Transcription";
"removeClaudeHooks: 无法写回 settings" = "removeClaudeHooks: unable to write back settings";
"removeCursorHooks: 无法写回 hooks.json" = "removeCursorHooks: unable to write back hooks.json";
"socket() 失败" = "socket() failed";
"sudo 执行失败: %@" = "sudo execution failed: %@";
"v%d.%d" = "v%d.%d";
"→ 重读电池电量" = "→ Re-read battery level";
"═══ 开始探测 ═══" = "═══ Start Probing ═══";
"═══ 探测完毕，等待回调 ═══" = "═══ Probing Done, Awaiting Callback ═══";
"⚙️ 重置开发环境签名（通常不需要）" = "⚙️ Reset Dev Environment Signing (usually not needed)";
"✓ 已上传 %d 帧" = "✓ %d frames uploaded";
"、" = ", ";
"三件套是怎么协同的" = "How the Three Pieces Work Together";
"上一步" = "Back";
"上传到设备" = "Upload to Device";
"下一步" = "Next";
"下面是 Mode 1（Claude）下，固件按 IDE state 的实际行为：" = "Below is the actual firmware behavior by IDE state in Mode 1 (Claude):";
"不点亮灯条。" = "Do not light the light bar.";
"与「设备信息 · Agent」中的启动相同，由 launchd 加载并执行 ahakeyconfig-agent。" = "Same startup as in \"Device Info · Agent\", loaded and executed by launchd.";
"两档分别管什么" = "What Each Gear Controls";
"中心快速脉冲扩散。" = "Fast central pulse diffusion.";
"中心脉冲" = "Center Pulse";
"中间停住" = "Stop in Center";
"中间最亮，两侧渐弱，适合停住提示。" = "Brightest in the center, fading to the sides; good for stop indication.";
"中间那个像键盘的图就是你的小键盘 1:1 镜像，所有元件可点" = "The keyboard-like image in the center is a 1:1 mirror of your mini keyboard; all components are tappable";
"临时由 AhaKey Studio 接管蓝牙，用于改键、LCD、同步和本机灯效测试。" = "Bluetooth is temporarily taken over by AhaKey Studio for key remapping, LCD, syncing, and local lighting tests.";
"主键" = "Main Key";
"乐观显示中" = "Optimistic Display";
"乐观更新画布" = "Optimistic Canvas Update";
"云端地址无效。" = "Cloud address invalid.";
"云端整理已启用" = "Cloud tidy enabled";
"云端未返回 access_token。" = "Cloud did not return access_token.";
"云端未返回可支付链接。" = "Cloud did not return a payable link.";
"云端未返回订单号，无法查询支付状态。" = "Cloud did not return an order number; unable to query payment status.";
"云端正在优化文本" = "Cloud is optimizing text";
"云端账号" = "Cloud Account";
"云端账号 · AhaType" = "Cloud Account · AhaType";
"云端账号 · AhaType…" = "Cloud Account · AhaType…";
"云端连接失败：%@" = "Cloud connection failed: %@";
"云端连接失败：TLS/SSL 校验未通过，请检查系统时间、网络代理/证书，或确认云端 HTTPS 证书配置正常。" = "Cloud connection failed: TLS/SSL verification did not pass. Please check system time, network proxy/certificate, or confirm that the cloud HTTPS certificate configuration is normal.";
"云端连接失败：当前网络无法访问 AhaType 服务，请检查网络后重试。" = "Cloud connection failed: current network cannot access AhaType services. Please check your network and retry.";
"亮度" = "Brightness";
"亮度 %d%%" = "Brightness %d%%";
"仅 Agent 连接蓝牙。Claude/Cursor/Codex/Kimi Code CLI Hook 才能驱动灯条与拨杆查询；本 App 里无法对键盘发 BLE 命令。" = "Only Agent connects via Bluetooth. Claude/Cursor/Codex/Kimi Code CLI Hooks are required to drive the light bar and dial queries; this app cannot send BLE commands to the keyboard.";
"仅在异常情况下使用：证书过期 / 换 Mac / Team ID 变化 / 钥匙串损坏导致权限失效时，点一下会重新签名 app 并重置 TCC 授权。正式发行版（无源码目录）看不到此按钮。" = "Use only in abnormal situations: when certificates expire, you switch Macs, Team ID changes, or keychain corruption causes permission failure. Tapping will re-sign the app and reset TCC authorization. This button is not visible in the official release (no source directory).";
"仍有权限未开启。请按上方状态逐项处理，全部变为绿色后再关闭弹窗。" = "Some permissions are still disabled. Please address each item above; close the popup only after all are green.";
"仍缺语音权限" = "Missing Voice Permissions";
"从 launchd 加载并启动/卸载停止 Agent 进程。" = "Load and start/unload and stop the Agent process from launchd.";
"从中心向两侧扩散的涟漪效果。" = "Ripple effect spreading from the center to both sides.";
"以下权限点击「申请」后会弹出系统对话框，直接点允许即可。" = "Clicking Apply will show system dialogs for these permissions; simply allow them.";
"以下权限需要前往系统设置手动开启，点击「打开设置」后在系统设置中操作。" = "These permissions require manually enabling them in System Settings. Click Open Settings to proceed.";
"任务可能随休眠中断" = "Tasks may be interrupted by sleep";
"任务完成" = "Task completed";
"任务状态动图" = "Task Status Animation";
"任务状态动图已写入设备。" = "Task status animation written to device.";
"任务状态图每张最多 30 帧（超出自动均匀抽帧），源文件 ≤ 2 MB，FPS 5–20。" = "Each task status image supports up to 30 frames (excess frames will be evenly sampled). Source file ≤ 2 MB, FPS 5–20.";
"优先用来触发语音输入，用户在软件里看到的是语音软件名，底层仍写成快捷键。" = "Preferentially used to trigger voice input; users see the voice software name in the app, while the underlying action is still sent as a shortcut.";
"会话开始" = "Session started";
"会话结束" = "Session ended";
"低电量" = "Low battery";
"体验输入" = "Try Input";
"作用范围" = "Scope";
"使用 AhaType 整理" = "Organize with AhaType";
"例如 Record / Accept / Reject / Backspace" = "e.g. Record / Accept / Reject / Backspace";
"依 Mode 默认：N / ⌫ / Esc。可改成宏序列。" = "Default by Mode: N / ⌫ / Esc. Can be changed to a macro sequence.";
"依 Mode 默认：Y / ↵ / ↵。可改成宏序列。" = "Default by Mode: Y / ↵ / ↵. Can be changed to a macro sequence.";
"保存" = "Save";
"保存 %@ 当前配置" = "Save %@ current config";
"保存全部配置到设备" = "Save all configs to device";
"保存配置" = "Save Configuration";
"保存配置到设备…" = "Save config to device…";
"信号" = "Signal";
"修复失败" = "Repair failed";
"修复完成" = "Repair completed";
"修改" = "Edit";
"修改会先保存在本地，连接设备后再同步。" = "Changes are saved locally first and synced after connecting to the device.";
"修饰键" = "Modifier keys";
"候选文件格式校验失败，未替换原配置" = "Candidate file format validation failed; original config not replaced";
"停止" = "Stop";
"允许 AhaKey Studio 使用苹果原生语音识别。" = "Allow AhaKey Studio to use native macOS speech recognition.";
"允许 AhaKey Studio 使用苹果原生语音采集。" = "Allow AhaKey Studio to use native macOS audio capture.";
"允许 AhaKey Studio 在后台监听实体语音键；设置完成后通常需要退出并重新打开。" = "Allow AhaKey Studio to listen for the physical voice key in the background; you usually need to quit and reopen after enabling.";
"允许 AhaKey Studio 扫描并连接 AhaKey 键盘。" = "Allow AhaKey Studio to scan for and connect to AhaKey keyboards.";
"允许 AhaKey Studio 把语音键转换成 macOS 原生转写或 Fn/Globe。" = "Allow AhaKey Studio to convert the voice key into native macOS transcription or Fn/Globe.";
"允许 AhaKey Studio 把语音键转换成苹果原生转写或 Fn/Globe。" = "Allow AhaKey Studio to convert the voice key into Apple native transcription or Fn/Globe.";
"充值到账已刷新。" = "Top-up balance refreshed.";
"充值成功，正在刷新额度。" = "Top-up successful, refreshing quota.";
"充值订阅" = "Top-up subscription";
"充电流动" = "Charging flow";
"先完成弹窗确认的权限" = "Complete dialog permissions first";
"先完成蓝牙、麦克风、语音转写等弹窗授权，再依次开启 Siri、听写、辅助功能，最后处理输入监控并重启。" = "Complete Bluetooth, microphone, and speech-recognition dialog permissions first, then Siri, Dictation, Accessibility, and finally Input Monitoring. A restart may be needed.";
"免费券兑换码" = "Free coupon code";
"免费券已生效。" = "Free coupon activated.";
"兑换" = "Redeem";
"兑换失败" = "Redemption failed";
"兑换失败。" = "Redemption failed.";
"兑换成功。" = "Redemption successful.";
"全部松开" = "All released";
"六大热区" = "Six Hot Zones";
"关闭" = "Close";
"关闭合盖运行" = "Disable Lid-close Running";
"关闭订单" = "Close order";
"内容" = "Content";
"内容已改" = "Content Changed";
"再到系统设置中开启" = "Then enable in System Settings";
"再次按语音键结束" = "Press voice key again to end";
"再次申请权限" = "Request permission again";
"写 cli-config（CLI）与 permissions.json 的 terminalAllowlist（Agent TUI「Not in allowlist」层）；分见官方文档。均先备份为 .ahakey.bak。" = "Write cli-config (CLI) and permissions.json's terminalAllowlist (Agent TUI “Not in allowlist” layer); see official documentation for details. Both are backed up as .ahakey.bak first.";
"写入 %@ %@ 宏: %@" = "Write %@ %@ macro: %@";
"写入 %@ %@ 快捷键" = "Write %@ %@ shortcut";
"写入 %@ %@ 快捷键: %@" = "Write %@ %@ shortcut: %@";
"写入 %@ %@ 描述: %@" = "Write %@ %@ description: %@";
"写入中…" = "Writing…";
"写入失败" = "Write failed";
"写入结果" = "Write Result";
"写入键盘" = "Write to Keyboard";
"写入键盘失败：%@" = "Failed to write to keyboard: %@";
"准备粘贴" = "Ready to paste";
"准备粘贴…" = "Ready to paste…";
"几种预设的差别" = "Differences between presets";
"出厂默认 Backspace，适合删除、撤销输入或清理当前内容。" = "Factory default Backspace, suitable for deleting, undoing input, or clearing current content.";
"分步授权" = "Step-by-step Permissions";
"切换 Mode 时 LCD 会先闪一下当前按键 description 文本（机械感效果），约 1 秒后回到该 Mode 的图片。" = "When switching Mode, the LCD will briefly flash the current key description text (mechanical feel effect), then return to that Mode's image after about 1 second.";
"切换为中文" = "Switch to Chinese";
"切换为英文" = "Switch to English";
"切换到当前模式时，LCD 会先显示该模式的按键描述，约 1 秒后回到该模式图片。" = "When switching to the current mode, the LCD will first show the key description for that mode, then return to that mode's image after about 1 second.";
"切换方式：键盘上的 Mode 拨杆，或主 App 顶部 Picker，或点画布上的 Mode 按钮。三处任一改动会同步另外两个。" = "Switch methods: the Mode dial on the keyboard, the Picker at the top of the main app, or the Mode button on the canvas. Changing any of the three will sync the other two.";
"切换模式时会先显示按键描述，再回到 Mode 1 默认图片。" = "When switching modes, the key description is shown first, then returns to the Mode 1 default image.";
"切换账号" = "Switch account";
"创建支付订单失败" = "Failed to create payment order";
"创建支付订单失败。" = "Failed to create payment order.";
"删除" = "Delete";
"删除键" = "Delete key";
"刷新" = "Refresh";
"刷新 AhaType 状态" = "Refresh AhaType Status";
"刷新到账" = "Refresh balance";
"刷新失败。" = "Refresh failed.";
"刷新本页" = "Refresh This Page";
"动图" = "Animation";
"动画管理" = "Animation Manager";
"动画需要 %d 帧，但设备当前没有足够连续空间。总容量上限约为 %d 帧。" = "The animation requires %d frames, but the device does not have enough contiguous space. Total capacity limit is about %d frames.";
"包季充值" = "Quarterly top-up";
"包年充值" = "Yearly top-up";
"包月充值" = "Monthly top-up";
"单点来回移动，适合运行中。" = "Single point moves back and forth, suitable for runtime.";
"单键 / 组合键" = "Single key / Combo";
"卸载" = "Uninstall";
"原因：" = "Reasons: ";
"发版包内未包含 ahakeyconfig-agent，无法使用守护进程。请用完整「AhaKey Studio.app」或联系开发者。" = "The release package does not include ahakeyconfig-agent, so the daemon cannot be used. Please use the full “AhaKey Studio.app” or contact the developer.";
"发送 AA BB 00 CC DD 查询设备状态" = "Send AA BB 00 CC DD to query device status";
"取消" = "Cancel";
"取消写入" = "Cancel Write";
"取消键" = "Cancel key";
"只要 AhaKey Studio 在后台运行，Mode 1 出厂语音键发出的 F18 就会被直接接管到苹果原生转写。现在不再依赖系统听写快捷键。" = "As long as AhaKey Studio is running in the background, the F18 sent by the Mode 1 factory voice key will be directly routed to Apple native transcription. It no longer depends on the system dictation shortcut.";
"合并 CLI + IDE 终端白名单" = "Merge CLI + IDE Terminal Allowlist";
"合并后的 JSON 无法写回：%@" = "Merged JSON could not be written back: %@";
"合盖也运行" = "Runs with lid closed";
"合盖保护" = "Lid-close Protection";
"合盖后也继续运行" = "Keep running after closing the lid";
"合盖运行关闭" = "Lid-close Running Off";
"合盖运行开启" = "Lid-close Running On";
"合盖运行设置" = "Lid-close Running Settings";
"合盖运行设置…" = "Lid-close Running Settings…";
"同一时间只能由本 App 或 Agent 其中之一连接键盘，请在此切换。" = "Only this app or the Agent can connect to the keyboard at a time. Switch here.";
"同步中…" = "Syncing…";
"同步到键盘后，短按实体键切换模式时，LCD 会先短暂显示这里的描述，然后回到该模式的图片。" = "After syncing to the keyboard, when short-pressing the physical key to switch modes, the LCD will briefly show the description here, then return to that mode's image.";
"后台监听中" = "Background listening";
"后台监听已启动。Fn/Globe 语音走 F19；macOS 原生与旧版 F18 会继续兼容。" = "Background listening started. Fn/Globe voice uses F19; macOS native and legacy F18 remain compatible.";
"后台监听已启动，但当前没有可接管的语音软件。" = "Background listening started, but no voice software is currently available to take over.";
"后台语音桥" = "Background voice bridge";
"后台轮询中，尝试寻找设备…" = "Background polling, trying to find device…";
"后续会继续增加文字状态、token 用量、模型环境等信息显示能力。" = "More display capabilities will be added later, including text status, token usage, and model environment info.";
"向设备发送探测命令，观察通信日志中的回调" = "Send a probe command to the device and watch the callback in the communication log";
"否" = "No";
"听写" = "Dictation";
"启动" = "Start";
"启动 Agent" = "Start Agent";
"启用 AhaType 云端整理" = "Enable AhaType cloud organization";
"周" = "Week";
"命令特征(0x7343) 就绪" = "Command signature (0x7343) ready";
"命令通道就绪" = "Command channel ready";
"命令通道未就绪" = "Command channel not ready";
"四个 Mode" = "Four Modes";
"回车" = "Return";
"固件" = "Firmware";
"固件升级中" = "Firmware Upgrade";
"固件宏" = "Firmware macro";
"固件宏（%d 步）" = "Firmware macro (%d steps)";
"固件按顺序串行发送；延时单位 3ms（最大 765ms）。需要更长延时请叠加多个延时步骤。" = "Firmware sends sequentially in order; delay unit is 3ms (max 765ms). For longer delays, stack multiple delay steps.";
"图片" = "Image";
"图片写入已取消。已完成的图片会保留，未完成的图片可稍后继续写入。" = "Image writing cancelled. Completed images will be kept; unfinished images can be continued later.";
"图片文件不符合上传限制。" = "Image file does not meet upload requirements.";
"图片显示" = "Image display";
"图片源文件约 %@，超过单文件上限 %@。请压缩分辨率、减少帧数或缩短图片后再试。" = "Image source file is about %@, exceeding the single-file limit of %@. Please reduce resolution, frame count, or length and try again.";
"图片管理" = "Image manager";
"在 %@ 中**未发现**包含 `ahakeyconfig-agent` 或 `ahakey-state` 的 `command`。\n\n若 Hook 在**项目级** `.cursor/hooks.json`，请在该仓库内手动删除；本按钮只改用户级 `~/.cursor/hooks.json`。" = "No `command` containing `ahakeyconfig-agent` or `ahakey-state` was found in %@.\n\nIf the hook is in a project-level `.cursor/hooks.json`, delete it manually in that repo; this button only modifies user-level ~/.cursor/hooks.json.";
"在 %@ 中未发现 AhaKey Codex hook 标记块。" = "No AhaKey Codex hook marker block found in %@.";
"在 %@ 中未发现 AhaKey Kimi hook 标记块或旧版裸 hook。" = "No AhaKey Kimi hook marker block or legacy bare hook found in %@.";
"在「系统设置 > Siri 与聚焦」里开启 Siri，供 macOS 原生语音能力使用。" = "Turn on Siri in “System Settings > Siri & Spotlight” for macOS native voice capabilities.";
"在「系统设置 > 键盘 > 听写」里开启听写，保证系统语音组件完整可用。" = "Turn on Dictation in “System Settings > Keyboard > Dictation” to ensure system voice components are fully available.";
"在「隐私与安全性 > 蓝牙」中允许 AhaKey Studio 使用蓝牙。" = "Allow AhaKey Studio to use Bluetooth in “Privacy & Security > Bluetooth”.";
"在系统设置 > Siri 与聚焦里开启 Siri。" = "Turn on Siri in System Settings > Siri & Spotlight.";
"在系统设置 > 键盘 > 听写里开启听写。" = "Turn on Dictation in System Settings > Keyboard > Dictation.";
"在系统设置中修改权限后，需重启本应用，检测才会与系统一致。" = "After changing permissions in System Settings, restart this app for detection to match the system state.";
"在这台 Mac 上设置 AhaKey" = "Set Up AhaKey on This Mac";
"备份 %@ 失败：%@" = "Backup of %@ failed: %@";
"复制全部" = "Copy All";
"复制支付链接" = "Copy payment link";
"外发 / DMG / Xcode：默认正式包在系统「隐私与安全性」里显示为「AhaKey Studio」；用 Xcode 以 Debug 运行本工程时显示为「AhaKey Studio（调试）」，请按名称分别授权。路径或签名不同也会被系统当成另一款 App。" = "Distributed / DMG / Xcode: the official release package appears as “AhaKey Studio” in System “Privacy & Security”; when running this project from Xcode in Debug, it appears as “AhaKey Studio (Debug)”. Please authorize each by name. A different path or signature will also be treated as another app by the system.";
"好" = "OK";
"如何使用" = "How to use";
"如何理解这个部件" = "How to understand this part";
"如果下面没你的问题，可以提 issue 到 GitHub 仓库" = "If your question isn't listed below, you can open an issue in the GitHub repository";
"始终允许（忽略所有限制）" = "Always Allow (Ignore All Limits)";
"安全阈值" = "Safety Thresholds";
"安全阈值触发：已降级合盖保护" = "Safety threshold triggered; lid-close protection downgraded";
"安全阈值触发：已降级合盖运行" = "Safety threshold triggered; lid-close running downgraded";
"安装 Agent + Hook" = "Install Agent + Hook";
"安装 Claude Hooks" = "Install Claude Hooks";
"安装 Codex Hooks" = "Install Codex Hooks";
"安装 Cursor Hooks" = "Install Cursor Hooks";
"安装 Kimi Hooks" = "Install Kimi Hooks";
"安装/修复 Agent 与 Hook，并启动 Agent 控制键盘。" = "Install/repair Agent and Hook, and start Agent to control the keyboard.";
"安装启动" = "Install & Start";
"安装启动后才能控制键盘" = "Keyboard control requires installation and startup first";
"安装完成。" = "Installation completed.";
"安装并启用" = "Install & Enable";
"完全释放电量" = "Full-release Battery";
"完成" = "Done";
"完成编辑" = "Finish Editing";
"完成键盘连接、后台语音键接管、macOS 原生语音和一次真实输入体验。" = "Complete keyboard connection, background voice-key takeover, native macOS speech, and a real input trial.";
"宏" = "Macro";
"宏：%@" = "Macro: %@";
"实时控制当前前台 Kimi" = "Real-time control of the frontmost Kimi";
"实时档位" = "Real-time gear";
"实验功能" = "Experimental";
"密码" = "Password";
"将先退出本应用，再自动重新打开。重新打开后「重新检查权限」会读取最新系统状态。" = "This app will quit first, then automatically reopen. After reopening, “Recheck Permissions” will read the latest system state.";
"将当前草稿同步到键盘，然后把蓝牙交还给 Agent。" = "Sync the current draft to the keyboard, then hand Bluetooth back to Agent.";
"将蓝牙交给 `ahakeyconfig-agent` 前，请先在下方完成「安装并启用」，生成 LaunchAgent。" = "Before handing Bluetooth to ahakeyconfig-agent, install and enable the LaunchAgent below.";
"尚无记录。在 Claude 中触发 PermissionRequest，在 Cursor 中让 Agent 调工具/Shell/MCP，或在 Kimi Code CLI 中触发工具调用后，会在此追加带 `ide` / `hookEvent` 的 JSON 行。若始终为空，请确认已安装 Agent、Hooks、蓝牙由 Agent 占用，且 `~/Library/.../AhaKeyConfig/diagnostics/` 可写。" = "No records yet. After triggering PermissionRequest in Claude, having the Agent call tools/Shell/MCP in Cursor, or triggering a tool call in Kimi Code CLI, JSON lines with `ide` / `hookEvent` will be appended here. If it remains empty, please confirm that Agent, Hooks are installed, Bluetooth is occupied by Agent, and `~/Library/.../AhaKeyConfig/diagnostics/` is writable.";
"尚无记录。触发 Codex 后应在此追加 JSON 行。若终端 Codex 有记录、Codex 客户端没有记录，说明客户端未加载当前 `~/.codex/config.toml` hook，通常需要重启 Codex 客户端/新开终端后再测。" = "No records yet. JSON lines should be appended here after triggering Codex. If Codex in the terminal has records but the Codex client does not, the client has not loaded the current `~/.codex/config.toml` hook; usually you need to restart the Codex client or open a new terminal and test again.";
"尚未安装 Agent，无法切回「键盘控制中」。请在「更多 → 设备信息 · Agent」里先安装并启用 Agent。" = "Agent is not installed yet, cannot switch back to “Keyboard controlling”. Please install and enable Agent first in “More → Device Info · Agent”.";
"尚未安装 LaunchAgent。请先点「安装并启用」。" = "LaunchAgent is not installed yet. Please tap “Install and enable” first.";
"尚未查询" = "Not queried yet";
"尚未检查权限。" = "Permissions not checked yet.";
"尚未检查麦克风、语音转写与 Siri 权限。" = "Microphone, speech transcription, and Siri permissions have not been checked yet.";
"尚未登录。" = "Not logged in yet.";
"尚未读取 AhaType 配置。" = "AhaType config not read yet.";
"尝试自动重连…" = "Trying to auto-reconnect…";
"就绪" = "Ready";
"展开下拉列表" = "Expand dropdown";
"工作中" = "Working";
"工作模式" = "Work Mode";
"工具完毕" = "Tool complete";
"工具执行" = "Run tool";
"工具批准（permission-request.log）" = "Tool Approvals (permission-request.log)";
"已上传 %d 个 LCD 动图，正在写入灯效与键位配置（约 %d 条）…" = "%d LCD animations uploaded; writing lighting and key configs (about %d entries)…";
"已上传 %d 个 LCD 图片，正在写入灯效与键位配置（约 %d 条）…" = "%d LCD images uploaded, writing light effects and key configs (about %d items)…";
"已上传 %d 帧到设备，槽位起点 %d；切换模式时会先显示描述，再回到当前模式图片。" = "%d frames uploaded to device, slot start %d; mode switch will show description first, then return to current image.";
"已从 %@ 移除 AhaKey Codex Hooks。" = "Removed AhaKey Codex Hooks from %@.";
"已从 %@ 移除 AhaKey Kimi Hooks。" = "Removed AhaKey Kimi Hooks from %@.";
"已从用户级 Cursor Hooks 中移除 AhaKey 相关条目（共 %@ 条子命令）。\n\n文件：%@\n\n若某仓库仍有**项目级** `.cursor/hooks.json` 且其中含有本工具，其优先级可能更高，需在该项目内同步删除或合并。" = "Removed AhaKey-related entries from user-level Cursor Hooks (%@ sub-commands).\n\nFile: %@\n\nIf any repo still has a project-level `.cursor/hooks.json` containing this tool, it may take priority; delete or merge it within that project.";
"已停止" = "Stopped";
"已全部写入设备并保存。" = "All settings written to device and saved.";
"已关闭支付订单。" = "Payment order closed.";
"已写入" = "Written";
"已写入：%@" = "Written: %@";
"已写回：%@\n（此前若存在同路径文件，已备份为 %@.ahakey.bak）\n\n本次在 permissions.allow 中新增合并 %@ 条常见 Shell(...) 规则（已有规则保留）；approvalMode 已设为 auto。\n\n若某版本仍弹窗，请把仍被拦的命令首词对照文档自行追加白名单：\nhttps://cursor.com/docs/cli/reference/permissions\n或检查工作区 .cursor/cli.json 是否另有限制。" = "Written back: %@\n(If a file existed at the same path, it was backed up as %@.ahakey.bak)\n\nMerged %@ common Shell(...) rules into permissions.allow (existing rules preserved); approvalMode set to auto.\n\nIf a version still prompts, add the first word of the blocked command to the allowlist according to the docs:\nhttps://cursor.com/docs/cli/reference/permissions\nOr check whether the workspace .cursor/cli.json has additional restrictions.";
"已写回：%@（备份为 %@.ahakey.bak）\n\n本次在 terminalAllowlist 中新增合并 %@ 条前缀；用于 Agent 内「Not in allowlist」层，与 cli-config 的 Shell(...) 是两套。文档：\nhttps://cursor.com/docs/reference/permissions" = "Written back: %@ (backed up as %@.ahakey.bak)\n\nMerged %@ prefixes into terminalAllowlist; used for the \"Not in allowlist\" layer inside the Agent, separate from cli-config Shell(...). Docs:\nhttps://cursor.com/docs/reference/permissions";
"已切换 Fn 按住状态；请在 Typeless/微信语音/豆包输入法内把快捷键设为 Fn/Globe（本 Studio 监听 F19，旧版 F18 兼容）。再点一次为松开。" = "Fn hold state toggled; set the shortcut to Fn/Globe in Typeless/WeChat Voice/Doubao Input Method (this Studio listens for F19, with legacy F18 support). Tap again to release.";
"已切换「苹果原生转写」录制状态（与界面「开始录音」相同）。" = "Toggled Apple native dictation recording (same as \"Start Recording\" in the UI).";
"已创建 %@，但无法更新 ~/.zshrc：%@。请手动把 `~/.local/bin` 加入 PATH。" = "Created %@, but could not update ~/.zshrc: %@. Please add `~/.local/bin` to PATH manually.";
"已删除内存中的 AhaKey 条目，但**无法写回** %@。请检查对「用户目录下 .cursor」的写权限，或关闭占用该文件的其他应用后重试。" = "Deleted AhaKey entries from memory, but could not write back %@. Check write permissions for ~/.cursor or close other apps using this file and try again.";
"已卸载 agent + hooks" = "Agent + hooks unloaded";
"已发送" = "Sent";
"已存在 %@ 但无法复制备份到 %@：%@" = "%@ exists but could not be copied to backup %@: %@";
"已存在 permissions.json 但无法备份到 %@：%@" = "permissions.json exists but could not be backed up to %@: %@";
"已完成 / 停止" = "Completed / Stopped";
"已开启" = "Enabled";
"已执行 launchctl load / start，但尚未检测到 Agent 在运行（未出现 %@）。\n\n" = "Ran launchctl load / start, but the Agent is not yet detected running (%@ not found).\n\n";
"已授权但蓝牙关闭" = "Authorized but Bluetooth off";
"已授权，但系统蓝牙当前关闭，请在控制中心或系统设置中打开。" = "Authorized, but Bluetooth is currently off. Please turn it on in Control Center or System Settings.";
"已断开" = "Disconnected";
"已断开，2s 后重连" = "Disconnected, reconnecting in 2s";
"已更新 %@ 的 %@ 预览；写入设备请使用底部通用按钮。" = "Updated %@ preview for %@; use the bottom universal button to write to the device.";
"已更新 %@ 的 LCD 预览；写入设备请使用底部通用按钮。" = "%@ LCD preview updated; use the bottom universal button to write to device.";
"已更新亮度为 %d%%；连接键盘后可预览到设备。" = "Brightness updated to %d%%; preview on device after connecting keyboard.";
"已更新虚拟灯效预览；连接键盘后可预览到设备。" = "Virtual lighting preview updated; preview on the device after connecting the keyboard.";
"已检测到 Codex App 自带 CLI，并修复终端命令：\n%@ → %@\n\n已将 `~/.local/bin` 加入 ~/.zshrc（若原文件存在，已备份为 ~/.zshrc.ahakey.bak）。" = "Detected the Codex App bundled CLI and fixed the terminal command:\n%@ → %@\n\nAdded `~/.local/bin` to ~/.zshrc (if the original file existed, it was backed up as ~/.zshrc.ahakey.bak).";
"已检测到 Codex App 自带 CLI，并创建终端命令：\n%@ → %@" = "Detected the Codex App bundled CLI and created the terminal command:\n%@ → %@";
"已清空 %@，写入设备后生效。" = "Cleared %@; takes effect after writing to the device.";
"已生成移除后的内容，但无法写回 %@：%@" = "Generated the removal content but could not write back %@: %@";
"已生效" = "Active";
"已用 %d · 无上限" = "Used %d · Unlimited";
"已由本 App 占用蓝牙：要让 Agent 接管，请将「蓝牙连接」选为 ahakeyconfig-agent。" = "Bluetooth is currently used by this app: to let the Agent take over, set \"Bluetooth Connection\" to ahakeyconfig-agent.";
"已登录，点击刷新获取用户信息。" = "Logged in; tap Refresh to load user info.";
"已登录，用户信息稍后可刷新。" = "Logged in; user info can be refreshed later.";
"已登录，等待刷新用户信息。" = "Logged in, waiting to refresh user info.";
"已自动同步默认动图（%d 帧）。" = "Default animation auto-synced (%d frames).";
"已自动同步默认图片（%d 帧）。" = "Default image auto-synced (%d frames).";
"已返回键盘控制，Agent 将接管蓝牙。" = "Returned keyboard control; the Agent will take over Bluetooth.";
"已进入编辑配置，AhaKey Studio 将临时接管蓝牙。" = "Entered edit config; AhaKey Studio will temporarily take over Bluetooth.";
"已连接" = "Connected";
"已连蓝牙" = "BLE connected";
"已退出登录。" = "Logged out.";
"已选 %d 帧图片预览；写入时将上传到 %@ 固定分区。" = "%d frames selected for preview; will upload to %@ fixed partition when writing.";
"已选 %d 帧图片：%@。" = "%d frames selected: %@.";
"已通知键盘切换到 %@。" = "Keyboard switched to %@.";
"已重新发送 %@ 当前模式。" = "Resent %@ current mode.";
"带拖尾的单向扫过，像彗星。" = "One-way sweep with a tail, like a comet.";
"帧数超过设备上限，最多支持 %d 帧。" = "Frame count exceeds the device limit; maximum supported is %d frames.";
"帮助中心" = "Help Center";
"常见问题" = "FAQ";
"应用全部键位到设备" = "Apply all key mappings to device";
"应用包内没有可执行的 ahakeyconfig-agent（路径：…/Contents/MacOS/ahakeyconfig-agent）。请确认发版脚本已把该二进制一并打进 .app；仅有主程序时无法安装守护进程。" = "The app bundle does not contain an executable ahakeyconfig-agent (path: …/Contents/MacOS/ahakeyconfig-agent). Make sure the release script packaged this binary into the .app; the daemon cannot be installed with only the main app.";
"底层 HID" = "Low-level HID";
"延时" = "Delay";
"开发中" = "In Development";
"开启合盖运行" = "Enable Lid-close Running";
"开启后，macOS 原生语音转写会先经过 AhaType 云端整理，再粘贴到当前光标。" = "When enabled, macOS native dictation will first be processed by the AhaType cloud, then pasted at the current cursor.";
"开启后，macOS 原生语音转写完成后会先请求云端整理，再粘贴整理后的文本。未登录、过期或网络失败时会自动回退原始转写。" = "When enabled, macOS native dictation will request cloud formatting after completion, then paste the formatted text. It automatically falls back to the original dictation if not logged in, expired, or on network failure.";
"开启后，使用 编程工具时 Mac 不会进入空闲休眠；macOS 14+ 还可合盖继续运行。" = "When enabled, your Mac won't enter idle sleep while using coding tools; on macOS 14+ it can keep running with the lid closed.";
"开启后，使用编程工具时 Mac 不会进入空闲休眠；macOS 14+ 还可合盖继续运行。" = "When enabled, your Mac won't enter idle sleep while using coding tools; on macOS 14+ it can keep running with the lid closed.";
"开启蓝牙后，AhaKey Studio 会接管出厂语音键并同步当前 Mode。" = "After turning on Bluetooth, AhaKey Studio takes over the factory voice key and syncs the current Mode.";
"开始体验" = "Get Started";
"开始录音" = "Start Recording";
"开始扫描 AhaKey 设备…" = "Scanning for AhaKey devices…";
"开始扫描…" = "Start scanning…";
"开始设置" = "Start Setup";
"开始试说" = "Try Speaking";
"引导分两步授权：先完成系统弹窗确认的权限，再前往系统设置开启其余权限，最后体验输入。" = "Authorization is in two steps: first confirm the permission in the system alert, then go to System Settings to enable the remaining permissions, and finally try input.";
"弹窗授权" = "Dialog Permissions";
"当前" = "Current";
"当前为组合键（%@）。若你只想发单键 Enter，勿打开 ⌘/⌃ 等，或点「清除修饰键」后再选 Enter。" = "Current combo: %@. If you only want single Enter, don't enable ⌘/⌃, or tap Clear Modifiers then choose Enter.";
"当前仅支持动图" = "Currently supports animations only";
"当前仅支持图片" = "Currently supports images only";
"当前会把快捷键和按键描述一起写入键盘。切换模式时，设备会先显示描述，再回到该模式的 LCD 图片。" = "The current mode writes both the shortcut and key description to the keyboard. When switching modes, the device first shows the description, then returns to the mode's LCD image.";
"当前图片共有 %d 帧，超过单模式上限 %d 帧。请减少帧数或缩短图片后再试。" = "Current image has %d frames, exceeding the per-mode limit of %d frames. Please reduce frame count or length and try again.";
"当前档位" = "Current Gear";
"当前模式没有语音路由：Fn 请选 Fn/Globe，或把「自定义快捷键」设为 F19。" = "The current mode has no voice routing: choose Fn/Globe for Fn, or set \"Custom Shortcut\" to F19.";
"当前模式的 LCD 图片" = "Current Mode LCD Image";
"当前模式还未上传图片，后续可替换成你的自定义图片。" = "No image has been uploaded for the current mode yet; you can replace it with your custom image later.";
"当前状态" = "Current Status";
"当前生效值" = "Current Active Value";
"当前由本 App 占用蓝牙。请打开下方「设备信息…」，在「蓝牙连接」里选「由 Agent 占用」后再启 Agent；与设备信息里「启动」按钮规则一致。" = "Bluetooth is currently used by this app. Open \"Device Info…\" below, select \"Used by Agent\" in \"Bluetooth Connection,\" then start the Agent; same rule as the \"Start\" button in Device Info.";
"当前由本 App 占用蓝牙，Agent 应处于未加载。请先在「蓝牙连接」中选中 Agent 后再启停守护进程。" = "Bluetooth is currently used by this app; the Agent should be unloaded. Please select Agent in \"Bluetooth Connection\" first, then start/stop the daemon.";
"当前目标：%@" = "Current target: %@";
"当前系统语言暂不支持苹果原生转写。" = "The current system language does not yet support Apple native dictation.";
"当前订单仍未到账，请确认微信支付已完成后再刷新。" = "The current order has not been received yet. Please confirm WeChat Pay is completed before refreshing.";
"当前选择由 ahakeyconfig-agent 占用蓝牙。请先在上方「蓝牙连接」切到 AhaKey Studio，或点击顶栏「设备信息 · Agent」切换。" = "Bluetooth is currently set to be used by ahakeyconfig-agent. Please switch \"Bluetooth Connection\" above to AhaKey Studio, or click the top bar \"Device Info · Agent\" to switch.";
"录音" = "Record";
"录音中" = "Recording";
"录音结束后根据下方开关决定是否经 AhaType 整理，再写入光标。" = "After recording ends, the toggle below decides whether to format via AhaType before writing to the cursor.";
"录音转写中" = "Recording & Transcribing";
"彗星拖尾" = "Comet Tail";
"彩色单点流水，更活跃。" = "Colorful single-dot flowing water, more lively.";
"彩虹慢波浪" = "Rainbow Slow Wave";
"彩虹波浪" = "Rainbow Wave";
"彩虹流水" = "Rainbow Flow";
"待开启" = "Pending";
"微信扫码完成支付，支付成功后会自动刷新额度。" = "Scan the QR code with WeChat to pay; the quota will refresh automatically after payment succeeds.";
"微信语音" = "WeChat Voice";
"快捷键" = "Shortcut";
"总开关" = "Switches";
"总览" = "Overview";
"恢复" = "Restore";
"恢复出厂默认键位" = "Restore Factory Default Keys";
"恢复当前模式默认值" = "Restore Current Mode Defaults";
"恢复默认" = "Restore Defaults";
"成功" = "Success";
"成功扫过" = "Successful Sweep";
"我已完成，重新检查" = "I'm done, recheck";
"所有特征就绪，查询设备状态" = "All characteristics ready, querying device status";
"手动批准" = "Manual Approve";
"手动批准：会交回用户/终端确认。若 Cursor、Codex 或 Kimi 仍弹窗，请看 diagnostics 里的 ide 与 diagnostic 字段。" = "Manual approval: returns to user/terminal confirmation. If Cursor, Codex, or Kimi still prompts, check the ide and diagnostic fields in diagnostics.";
"手机号" = "Phone Number";
"手机号：%@" = "Phone: %@";
"打字涟漪" = "Typing Ripple";
"打开主窗口" = "Open Main Window";
"打开内嵌的帮助中心" = "Open Embedded Help Center";
"打开系统蓝牙，用于发现、连接和同步 AhaKey 键盘。" = "Turn on system Bluetooth to discover, connect, and sync the AhaKey keyboard.";
"打开系统设置" = "Open System Settings";
"打开设置" = "Open Settings";
"执行失败: %@" = "Execution failed: %@";
"扫描中" = "Scanning";
"扫描中…" = "Scanning…";
"扫描条" = "Scanner";
"扫描超时，继续后台轮询设备" = "Scan timed out, continuing background polling for device";
"批准" = "Approve";
"批准方式" = "Approval Mode";
"找不到可执行脚本：%@\n\n此功能仅在从源码运行的开发构建中可用。" = "Executable script not found: %@\n\nThis feature is only available in development builds run from source.";
"拒绝" = "Deny";
"拨杆" = "Switch";
"拨杆 → 手动批准" = "Toggle → Manual Approval";
"拨杆 → 自动批准" = "Toggle → Auto Approval";
"拨杆切换时，自动向前台 Terminal.app / iTerm2 的 Kimi tab 发送 /yolo on/off。默认关闭。" = "When the switch is toggled, automatically send /yolo on/off to the frontmost Terminal.app / iTerm2 Kimi tab. Off by default.";
"拨杆在 IDE 中生效需先安装 Agent 与 Hook，并把蓝牙交给 Agent；否则仅为状态显示。" = "The toggle takes effect in the IDE only after installing the Agent and Hook, and handing Bluetooth to the Agent; otherwise it is only a status indicator.";
"拨杆对 Claude / Cursor / Codex / Kimi **同时生效**，与键盘当前所在 Mode 无关。Agent 后台同时监听所有 IDE 的 Hook，拨杆拨动后四个 IDE 的批准行为立即切换。" = "The toggle **works simultaneously** for Claude / Cursor / Codex / Kimi, regardless of the keyboard's current Mode. The Agent listens to all IDE hooks in the background; once toggled, approval behavior in all four IDEs switches immediately.";
"拨杆已切到手动档，但当前 Kimi 会话可能仍处于 YOLO。请立即手动执行 /yolo off。" = "The switch has moved to Manual, but the current Kimi session may still be in YOLO. Please run /yolo off manually now.";
"拨杆我点了，但键盘灯效没切" = "I toggled it, but the keyboard lighting didn't switch";
"拨杆是物理档位，不是按下瞬态。0 档显示「自动批准」，1 档显示「手动批准」。这里只读取键盘上报的位置，不模拟物理拨动。" = "The toggle is a physical position, not a momentary press. Position 0 shows \"Auto Approval,\" position 1 shows \"Manual Approval.\" Only the position reported by the keyboard is read; it does not simulate physical toggling.";
"拨杆档位" = "Switch Position";
"按一下开始，再按一下结束" = "Press once to start, press again to stop";
"按下" = "Press";
"按住" = "Hold";
"按住录音，松手即发送" = "Hold to record, release to send";
"按住键盘录音键不松手开始录音，松手后直接将 ASR 结果写入，响应更快。" = "Hold the keyboard record key to start recording; releasing writes the ASR result directly for faster response.";
"按季订阅" = "Quarterly Subscription";
"按年订阅" = "Yearly Subscription";
"按月订阅" = "Monthly Subscription";
"按键描述" = "Key Description";
"按键映射" = "Key Mapping";
"按键职责" = "Key Function";
"授权步骤" = "Authorization Steps";
"排查请看 voice-relay.log（matched · function relay · post fn）。路径：~/Library/Application Support/AhaKeyConfig/diagnostics/" = "For troubleshooting, see voice-relay.log (matched · function relay · post fn). Path: ~/Library/Application Support/AhaKeyConfig/diagnostics/";
"探测协议" = "Probe Protocol";
"控制方" = "Controller";
"描述" = "Description";
"提醒用户当前需要确认。" = "Remind the user that confirmation is currently required.";
"播放速度" = "Playback Speed";
"播放速度 %d FPS" = "Playback speed %d FPS";
"改键、LCD、同步、本机灯效测试（macOS 暂不支持 USB 有线配置）" = "Key remapping, LCD, sync, local lighting test (macOS does not currently support USB wired config)";
"数据特征(0x7341) 已订阅通知" = "Data characteristic (0x7341) notification subscribed";
"整条呼吸" = "Full Breathing";
"整条均匀起伏，适合等待确认。" = "Smooth full-length rise and fall, good for waiting for confirmation.";
"整条彩色流动，更显眼。" = "Full-length colorful flow, more eye-catching.";
"文字、token、模型状态显示开发中" = "Text, token, and model status display are under development";
"断开" = "Disconnect";
"新增：合盖运行" = "New: Lid-close Running";
"新手引导" = "Onboarding";
"新手权限已经齐了。关闭这个弹窗后，AhaKey Studio 可以连接键盘、后台监听语音键，macOS 原生语音也可以正常使用。" = "All required permissions are set. After closing this alert, AhaKey Studio can connect to the keyboard, listen for the voice key in the background, and macOS native dictation can work normally.";
"新手权限引导" = "Permission Onboarding";
"新版 Kimi Code 的 dial-aware launcher 已安装到 %@。" = "The new dial-aware Kimi Code launcher has been installed to %@.";
"无图片" = "No Image";
"无法写入 %@：%@" = "Unable to write %@: %@";
"无法写入 LaunchAgent 配置文件：%@\n\n将写入：%@\n已尝试创建目录：%@\n若仍失败，请检查对「~/Library」是否有写权限，或本机管理策略是否禁止用户 LaunchAgents。" = "Unable to write LaunchAgent config file: %@\n\nWill write: %@\nAttempted to create directory: %@\nIf it still fails, check write access to ~/Library or whether the machine policy prohibits user LaunchAgents.";
"无法写回：%@" = "Unable to write back: %@";
"无法创建 LCD 编码上下文。" = "Unable to create LCD encoding context.";
"无法创建目录 %@：%@" = "Unable to create directory %@: %@";
"无法删除 launcher %@：%@" = "Unable to delete launcher %@: %@";
"无法启动修复脚本: %@" = "Unable to launch repair script: %@";
"无法启动麦克风录音。" = "Unable to start microphone recording.";
"无法安装新版 Kimi Code launcher：%@" = "Unable to install new Kimi Code launcher: %@";
"无法恢复 %@：%@" = "Unable to restore %@: %@";
"无法获取 IOPMrootDomain" = "Unable to get IOPMrootDomain";
"无法解析 %@（非合法 JSON 或已损坏）。请用编辑器打开修正后再试，或从备份恢复。" = "Unable to parse %@ (invalid JSON or corrupted). Please open it in an editor, fix it, and try again, or restore from a backup.";
"无法读取 %@" = "Unable to read %@";
"无法读取 %@，请检查权限。" = "Unable to read %@; check permissions.";
"无法读取图片文件。" = "Unable to read image file.";
"日" = "Day";
"日常使用由 Agent 控制键盘；需要改键、LCD 或同步时，进入编辑配置后由 AhaKey Studio 临时接管蓝牙。" = "Daily use is handled by the Agent controlling the keyboard; when key remapping, LCD, or syncing is needed, AhaKey Studio temporarily takes over Bluetooth after entering edit config.";
"旧版 F18 兼容" = "Legacy F18 Support";
"是（等待对齐）" = "Yes (waiting to align)";
"显示在键盘 LCD 上" = "Show on Keyboard LCD";
"显示逻辑" = "Display Logic";
"暂无" = "None";
"暂无配额信息。" = "No quota info available.";
"更多" = "More";
"替换成自己的图片" = "Replace with Your Image";
"最后可以直接口述一句话，确认识别和写入链路都已准备好。" = "Finally, speak a sentence to confirm recognition and insertion are ready.";
"最后试一次真实输入" = "Finally try a real input";
"最大合盖保护时长" = "Max Lid-close Duration";
"最新固件 0x91 已用于灯效预览；虚拟拨杆只影响 Hook auto-approve，不再写键盘 sw_state。" = "Latest firmware 0x91 is used for lighting preview; the virtual toggle only affects Hook auto-approve and no longer writes keyboard sw_state.";
"最近写入：%@" = "Last written: %@";
"最近同步 %@" = "Last synced %@";
"最长 15 字节" = "Up to 15 bytes";
"月" = "Month";
"有效期 %@" = "Valid until %@";
"有效期：%@" = "Valid until: %@";
"有效期：无" = "Validity: None";
"服务器返回非 JSON。" = "Server returned non-JSON.";
"未上传" = "Not Uploaded";
"未同步" = "Not Synced";
"未同步改动 %d" = "%d unsynced changes";
"未在 PATH 中找到 `codex` 命令，也未找到 Codex App 自带 CLI：%@。Hook 配置已安装；若需在终端使用 Codex，请先安装或更新 Codex 客户端。" = "The `codex` command was not found in PATH, and the Codex App bundled CLI was not found: %@. Hook config is installed; to use Codex in the terminal, install or update the Codex client first.";
"未安装 LaunchAgent，无法将蓝牙交给 Agent，临时允许 App 连接" = "LaunchAgent not installed; cannot hand Bluetooth to Agent. Temporarily allowing app connection.";
"未就绪" = "Not Ready";
"未开启" = "Off";
"未找到 %@，无需移除 Codex Hooks。" = "%@ not found; no Codex Hooks to remove.";
"未找到 %@，无需移除 Kimi Hooks。" = "%@ not found; no Kimi Hooks to remove.";
"未找到用户级 %@。\n\n若你只在**项目**里合并过 `.cursor/hooks.json`，需在该项目根目录中手动编辑或删除 AhaKey 相关条目，用户级里本来就没有可卸内容。" = "User-level %@ not found.\n\nIf you only merged `.cursor/hooks.json` inside a project, edit or delete AhaKey-related entries in that project root; there was nothing to uninstall at user level.";
"未授权" = "Unauthorized";
"未激活" = "Inactive";
"未生效" = "Inactive";
"未知" = "Unknown";
"未装 Agent" = "Agent not installed";
"未设置" = "Not Set";
"未设置（用键盘真实值）" = "Not set (using keyboard value)";
"未识别到内容" = "No content recognized";
"未识别到有效语音内容。" = "No valid voice content recognized.";
"未运行" = "Not running";
"未连接" = "Not Connected";
"未配置语音软件。" = "No voice software configured.";
"本 App 主动连接键盘。" = "This app actively connects to the keyboard.";
"本 App 已连接蓝牙" = "This app is connected";
"本 App 未连接" = "This app is not connected";
"本 App 连接蓝牙，用于配置与同步。Agent 的 LaunchJob 在持有方为 App 时不会加载，避免抢连接。" = "This App connects via Bluetooth for configuration and sync. The Agent's LaunchJob will not load when the App holds the connection, to avoid contention.";
"本地识别中" = "Local recognition in progress";
"权限清单" = "Permission list";
"权限诊断" = "Permission Diagnostics";
"权限诊断弹窗里。可以不连键盘就验证 macOS 原生转写是否能识别。如果转写失败，多半是麦克风权限或没装语言模型（系统设置 → Siri 与听写 → 听写语言）。" = "In the permission diagnostics popup. You can verify whether macOS native transcription recognizes speech without connecting a keyboard. If transcription fails, it is usually due to microphone permissions or a missing language model (System Settings → Siri & Dictation → Dictation Languages).";
"来回流水" = "Flowing back and forth";
"松开" = "Release";
"查看日志" = "View Logs";
"查看设置" = "View Settings";
"查看语音权限状态与诊断日志" = "View voice permission status and diagnostic logs";
"查询状态" = "Query Status";
"查询订单状态失败" = "Failed to query order status";
"查询设备状态…" = "Querying device status…";
"检测到应用签名变化" = "App Signature Changed";
"检测到终端中 `codex` 不可用，但无法创建 %@：%@。Hook 配置已安装。" = "Detected that `codex` is unavailable in the terminal, but could not create %@: %@. Hook config is installed.";
"检测目标" = "Detection Targets";
"模拟按一次语音键" = "Simulate pressing the voice key once";
"橙色快速闪烁，适合警告。" = "Orange rapid flashing, suitable for warnings.";
"欢迎" = "Welcome";
"正在上传 %@ 的 LCD 图片…" = "Uploading %@ LCD image…";
"正在上传图片到 %@…" = "Uploading image to %@…";
"正在停止当前图片写入；已完成的图片会保留…" = "Stopping current image writing; completed images will be kept…";
"正在兑换免费券…" = "Redeeming free coupon…";
"正在写入 %@…" = "Writing %@…";
"正在写入当前光标" = "Writing current cursor";
"正在写入灯效与键位配置（约 %d 条）…" = "Writing light effects and key configs (about %d items)…";
"正在准备写入设备…" = "Preparing to write to device…";
"正在创建微信支付订单…" = "Creating WeChat Pay order…";
"正在刷新用户信息…" = "Refreshing user info…";
"正在取消…" = "Cancelling…";
"正在恢复键盘控制，Agent 正在连接键盘…" = "Restoring keyboard control, Agent is connecting to keyboard…";
"正在整理语音文本" = "Organizing voice text";
"正在查询订单状态…" = "Querying order status…";
"正在检查系统权限…" = "Checking system permissions…";
"正在检查麦克风与语音转写权限…" = "Checking microphone and voice transcription permissions…";
"正在结束录音并整理文字…" = "Ending recording and organizing text…";
"正在请求云端账号…" = "Requesting cloud account…";
"正在预览灯光强度：%d%% 。" = "Previewing light intensity: %d%%.";
"正在预览灯效：%@。" = "Previewing light effect: %@.";
"步骤（依次执行）" = "Steps (execute in order)";
"每周" = "Weekly";
"每日" = "Daily";
"每月" = "Monthly";
"比普通彩虹波浪更慢，适合做氛围效果。" = "Slower than the regular rainbow wave, good for ambient effects.";
"没有可上传的图片帧。" = "No image frames to upload.";
"没有可编码的图片帧。" = "No image frames to encode.";
"没有未同步改动，直接把蓝牙交还给 Agent。" = "No unsynced changes; hand Bluetooth back to Agent.";
"注册" = "Sign up";
"注册失败。" = "Sign-up failed.";
"注册成功。" = "Sign-up successful.";
"注册登录" = "Register / Log In";
"添加 GIF" = "Add GIF";
"添加图片" = "Add image";
"添加步骤" = "Add step";
"清空" = "Clear";
"清空剪贴板" = "Clear Clipboard";
"清除 %@ %@ 宏层（将写入快捷键）" = "Clear %@ %@ macro layer (will write shortcut)";
"清除 %@ %@ 快捷键" = "Clear %@ %@ shortcut";
"清除 %@ %@ 快捷键层（将写入宏）" = "Clear %@ %@ shortcut layer (will write macro)";
"清除修饰键" = "Clear modifier keys";
"灯光" = "Lighting";
"灯效映射 %@" = "Light effect mapping %@";
"灯条" = "Light bar";
"灯条、LCD 屏幕、Key1（语音）、Key2、Key3、Key4、拨杆。点哪个就在右侧 Inspector 看到那个元件的配置。" = "Light bar, LCD screen, Key1 (voice), Key2, Key3, Key4, and switch. Click any to see that component's configuration in the Inspector on the right.";
"灯条颜色" = "Light bar color";
"点亮键盘顶端 8 颗 WS2812 LED；颜色和效果跟随 IDE Hook 状态。" = "Lights up the 8 WS2812 LEDs on top of the keyboard; color and effect follow the IDE Hook state.";
"点击切换 Mode（模拟实体键）" = "Click to switch Mode (simulates physical key)";
"点击按钮发送对应状态到键盘，观察 LED 变化。" = "Click a button to send the corresponding state to the keyboard and observe LED changes.";
"点击状态会在虚拟键盘预览，并通过 0x91 临时预览到设备；保存请使用底部通用按钮。" = "Clicking a state previews it on the virtual keyboard and temporarily on the device via 0x91; use the bottom common buttons to save.";
"点底栏的「权限诊断」按钮打开（不是这里的页面）" = "Open via the \"Permission Diagnostics\" button in the bottom bar (not this page)";
"点按灯条、屏幕、四个按键或拨杆即可进入对应配置。" = "Tap the light bar, screen, four keys, or switch to enter the corresponding configuration.";
"点画布拨杆触发三件事（不是所有都生效）：" = "Toggling the canvas switch triggers three actions (not all may apply):";
"熄灭" = "Off";
"物理拨杆坏了？或想软件控制？看这里" = "Physical switch broken? Or want software control? See here";
"特征" = "Characteristics";
"状态反馈" = "Status Feedback";
"状态灯效映射" = "Status light effect mapping";
"状态行" = "Status row";
"状态资源：固件按 Hook 状态自动切换工作中、等待授权、已完成。" = "Status resources: the firmware automatically switches among Working, Awaiting Authorization, and Completed based on Hook state.";
"状态预览" = "Status preview";
"状态：%@" = "Status: %@";
"现在申请权限" = "Request permissions now";
"现在键盘 flash 各 Mode 状态" = "Keyboard now flashes each Mode state";
"现状一览" = "Current status overview";
"琥珀色呼吸 + 中心闪烁，等待用户操作。" = "Amber breathing + center blinking, waiting for user action.";
"用户主动断开" = "User disconnected";
"用户信息已刷新。" = "User info refreshed.";
"用户提交" = "User submit";
"用户请求：合盖保护" = "User Request: Lid-close Protection";
"用户请求：阻止空闲休眠" = "User Request: Prevent Idle Sleep";
"申请" = "Apply";
"电池特征(0x2A19) 读取中" = "Reading battery characteristic (0x2A19)";
"电量" = "Battery";
"电量过低，已完全释放合盖运行" = "Battery too low; lid-close running fully released";
"画布上灯条不变色" = "Light bar on canvas does not change color";
"画布与按键" = "Canvas and keys";
"画布预览：%@" = "Canvas preview: %@";
"登录" = "Log in";
"登录后可使用 AhaType 云端大模型整理。" = "After logging in, you can use the AhaType cloud LLM to organize.";
"登录后可启用 AhaType 云端整理。" = "After logging in, you can enable AhaType cloud organization.";
"登录失败。" = "Login failed.";
"登录成功。" = "Login successful.";
"直接按下键盘快捷键即可" = "Just press the keyboard shortcut";
"直接按键设置主键，点击箭头展开下拉列表。" = "Press a key directly to set the primary key, or click the arrow to expand the dropdown.";
"直接自己指定底层快捷键。" = "Directly specify the underlying shortcut yourself.";
"知道了" = "Got it";
"短按" = "Short press";
"短按 + 长按" = "Short press + long press";
"短按 vs 长按" = "Short press vs. long press";
"硬件物理键码 + 软件配置同步切换" = "Hardware physical keycode + software config switch simultaneously";
"硬性限制：源文件 ≤ 2 MB，FPS 1–30，单模式最多 70 帧；Mode 1/2/3/4 固定写入 slot 10/80/150/220。" = "Hard limits: source file ≤ 2 MB, FPS 1–30, up to 70 frames per mode; Mode 1/2/3/4 are fixed to slots 10/80/150/220.";
"确定" = "OK";
"确认恢复" = "Confirm Restore";
"确认键" = "Confirm key";
"移除 Claude Hooks" = "Remove Claude Hooks";
"移除 Codex Hooks" = "Remove Codex Hooks";
"移除 Cursor Hooks" = "Remove Cursor Hooks";
"移除 Kimi Hooks" = "Remove Kimi Hooks";
"稍后再说" = "Later";
"稍后再退" = "Exit later";
"空" = "Empty";
"空宏。点下方「添加步骤」开始录制。" = "Empty macro. Tap \"Add step\" below to start recording.";
"空操作" = "No operation";
"空白" = "Blank";
"立即恢复正常休眠" = "Restore Normal Sleep Now";
"立即翻转画布拨杆位置 + 顶部状态栏；视觉零延迟" = "Instantly flip canvas switch position + top status bar; visually zero latency";
"立即退出 App" = "Quit App now";
"立即重启" = "Restart now";
"第一步：弹窗确认授权" = "Step 1: Dialog Permissions";
"第三步：体验输入" = "Step 3: Try Input";
"第二步：系统设置授权" = "Step 2: System Settings Permissions";
"等待审批" = "Pending approval";
"等待批准" = "Waiting for approval";
"等待授权" = "Waiting for authorization";
"等待支付超时，可稍后刷新用户信息确认到账。" = "Payment timed out; you can refresh user info later to confirm receipt.";
"等待权限" = "Waiting for permissions";
"等待系统权限" = "Waiting for system permissions";
"等待自定义" = "Waiting for customization";
"等待苹果原生转写就绪。" = "Waiting for Apple native transcription to be ready.";
"等待触发" = "Waiting for trigger";
"等待设备" = "Waiting for device";
"等待设备响应超时: 0x%02X" = "Device response timeout: 0x%02X";
"等待语音路由初始化。" = "Waiting for voice routing initialization.";
"简体中文" = "Simplified Chinese";
"类型" = "Type";
"系统设置" = "System Settings";
"系统设置授权" = "System Settings Permissions";
"红色慢闪，表示低电量。" = "Red slow flashing, indicates low battery.";
"绑定" = "Bind";
"结束并写入" = "Finish & Write";
"继续编辑" = "Continue Editing";
"绿色从左到右逐渐点亮。" = "Green gradually lights up from left to right.";
"绿色填充流动，表示充电中。" = "Green fill flowing, indicates charging.";
"编程中" = "Coding";
"编程合盖保护" = "Coding Lid-close Protection";
"编程时阻止系统休眠" = "Prevent sleep while coding";
"编辑配置" = "Edit Configuration";
"编辑配置中" = "Editing Configuration";
"脚本执行失败 (exit=%d)\n\n%@" = "Script execution failed (exit=%d)\n\n%@";
"自动批准" = "Auto Approve";
"自动批准依赖 Agent 与 Hook，且须蓝牙由 Agent 占用" = "Auto-approve depends on Agent and Hook, and Bluetooth must be held by Agent";
"自动批准：**Claude / Codex PermissionRequest**，**Cursor preToolUse**（含 cli-config）。**Kimi**：安装过 AhaKey Kimi Hooks 后，拨杆会直接接管**当前会话**的自动批准；刚装完或刚升级 kimi-cli 时，重开一次 kimi 即可。" = "Auto-approve: **Claude / Codex PermissionRequest**, **Cursor preToolUse** (including cli-config). **Kimi**: after installing AhaKey Kimi Hooks, the switch directly takes over auto-approval for the **current session**; after a fresh install or kimi-cli upgrade, simply restart kimi once.";
"自定义快捷键" = "Custom shortcut";
"自定义模式。" = "Custom mode.";
"自定义模式：可自由配置所有按键和灯效。" = "Custom mode: freely configure all keys and lighting effects.";
"若仍出现手动：在「设备信息」里打开「工具批准诊断」查看 permission-request.log（含 ide、hookEvent、diagnostic 等）。" = "If manual prompts still appear: open \"Tool Approval Diagnostics\" in \"Device Info\" to view permission-request.log (contains ide, hookEvent, diagnostic, etc.).";
"若系统里已勾选允许，本应用仍显示未开启：请完全退出 AhaKey Studio 并再启动一次。输入监控、辅助功能等常按进程生效，只点「重新检查」或从后台切回，有时读到的仍是旧状态，重启后即可与系统设置一致。" = "If the system already has permission enabled but this app still shows it off: fully quit AhaKey Studio and relaunch. Input monitoring and accessibility permissions often take effect per process; clicking \"Recheck\" or returning from the background may still read the old state, and a restart will match System Settings.";
"若需与「⌘↵ 接受 / ⌘⌫ 拒绝」等组合键一致，请在编辑器里为对应键加修饰，并在 Cursor 设置 → Keyboard Shortcuts 中绑成相同组合。" = "To match combos like \"⌘↵ Accept / ⌘⌫ Reject\", add modifiers to the corresponding keys in the editor and bind the same combo in Cursor Settings → Keyboard Shortcuts.";
"苹果原生转写" = "Apple native transcription";
"苹果原生转写失败：%@" = "Native macOS transcription failed: %@";
"苹果原生转写已就绪，按一次语音键开始，再按一次结束。" = "Apple native transcription is ready; press the voice key once to start, and again to finish.";
"苹果原生转写录音中… 再按一次语音键结束。" = "Apple native transcription recording… Press the voice key again to finish.";
"获取用户信息失败" = "Failed to get user info";
"蓝牙" = "Bluetooth";
"蓝牙、麦克风和语音转写可以直接弹窗确认，点击「申请」后在弹窗中允许即可。" = "Bluetooth, microphone, and voice transcription can be confirmed directly in the popup; click \"Request\" and then allow in the popup.";
"蓝牙关闭" = "Bluetooth off";
"蓝牙可用，可以扫描并连接键盘。" = "Bluetooth is available; you can scan and connect to the keyboard.";
"蓝牙就绪" = "Bluetooth ready";
"蓝牙已关闭" = "Bluetooth is off";
"蓝牙已开启" = "Bluetooth is on";
"蓝牙权限未开启" = "Bluetooth permission not enabled";
"蓝牙连接" = "Bluetooth Connection";
"蓝色呼吸波浪，适合思考中。" = "Blue breathing wave, suitable for thinking.";
"蓝色思考" = "Blue thinking";
"虚拟拨杆" = "Virtual switch";
"虚拟拨杆 → 手动批准（hook 交回终端确认）" = "Virtual switch → manual approval (hook returns to terminal for confirmation)";
"虚拟拨杆 → 自动批准（hook 自动放行；灯效若不变需先刷支持 0x91 的固件）" = "Virtual switch → auto-approve (hook auto-approves; if lighting effect doesn't change, flash firmware that supports 0x91 first)";
"虚拟拨杆不再占用 0x91，避免与最新固件的灯效预览命令冲突。" = "Virtual switch no longer occupies 0x91, avoiding conflicts with the latest firmware's lighting preview command.";
"表示本轮执行已经完成。" = "Indicates this round of execution is complete.";
"规划中，保留入口。" = "In planning, entry reserved.";
"触发方式" = "Trigger method";
"触发阈值" = "Trigger threshold";
"警告闪烁" = "Warning flash";
"订单尚未到账，请稍后再刷新。" = "Order not yet received, please refresh later.";
"订单已创建，请使用微信扫码支付。" = "Order created, please scan the QR code with WeChat to pay.";
"订单已标记为失败，请重新发起充值。" = "Order marked as failed, please initiate recharge again.";
"订单支付失败。" = "Order payment failed.";
"订单状态查询失败。" = "Order status query failed.";
"订单：%@" = "Order: %@";
"记住密码" = "Remember password";
"设备 LCD 只稳定支持 ASCII。中文、emoji 和全角字符会在写入时被自动过滤，避免乱码。" = "The device LCD only reliably supports ASCII. Chinese characters, emoji, and full-width characters are automatically filtered when writing to avoid garbled text.";
"设备信息" = "Device Info";
"设备信息 · Agent" = "Device info · Agent";
"设备信息 · Agent…" = "Device Info · Agent…";
"设备信息(0x7342) 就绪" = "Device Info (0x7342) Ready";
"设备信息（蓝牙 / 启停 Agent）…" = "Device Info (Bluetooth / Start-Stop Agent)…";
"设备名" = "Device Name";
"设备实际写入：%@" = "Actually written: %@";
"设备拒绝了命令 0x%02X，状态码 0x%02X" = "Device rejected command 0x%02X, status code 0x%02X";
"设备未连接或命令通道未就绪，当前只保存本地草稿。" = "Device not connected or command channel not ready; only saving local draft for now.";
"设备未连接，请先连接键盘后重试。" = "Device not connected. Please connect the keyboard and try again.";
"设备没有保存对应状态的任务动画槽位信息；请更新到支持任务图的固件后重试。" = "The device has no task animation slot info saved for this state; please update to firmware that supports task images and retry.";
"设备状态查询" = "Device Status Query";
"设备该槽为空" = "This device slot is empty";
"设备返回的任务动画槽位信息无法解析；请确认键盘已烧录任务 GIF 固件。" = "Unable to parse task animation slot info returned by the device; please confirm the keyboard has task-GIF firmware flashed.";
"设备返回的动画槽位信息无法解析。" = "Unable to parse animation slot info returned by device.";
"设备连接中，连接成功后将自动同步并返回控制模式…" = "Connecting to device; will auto-sync and return to control mode after successful connection…";
"设置路线" = "Setup Path";
"识别失败" = "Recognition Failed";
"识别完成，但写入当前光标失败。" = "Recognition complete, but writing to current cursor failed.";
"诊断日志" = "Diagnostic Logs";
"语言 / Language" = "Language";
"语言更改将在下次启动 AhaKey Studio 后生效。" = "Language changes will take effect after restarting AhaKey Studio.";
"语音" = "Voice";
"语音已准备" = "Voice Ready";
"语音文本已完成" = "Voice Text Completed";
"语音桥" = "Voice Bridge";
"语音结果直接粘贴" = "Voice result pasted directly";
"语音识别权限已被拒绝" = "Voice recognition permission has been denied";
"语音转写" = "Speech Recognition";
"语音输入" = "Voice Input";
"语音输入方式" = "Voice Input Method";
"语音键" = "Voice Key";
"语音键后台监听准备中。关闭窗口后，AhaKey Studio 也会继续驻留后台。" = "Voice key background monitoring is preparing. After closing the window, AhaKey Studio will continue running in the background.";
"语音键的输入方式独立于当前 Mode，在任意 Mode 下都可使用相同的语音输入设置。" = "The voice key input method is independent of the current Mode; the same voice input settings can be used in any Mode.";
"语音键预设会固定使用单键绑定；如需录制宏，请先把预设改为自定义快捷键。" = "Voice key presets will always use a single-key binding; to record a macro, please change the preset to a custom shortcut first.";
"请依次开启 Siri、听写、辅助功能，最后开启输入监控。输入监控设置后通常需要退出并重新打开，本引导会记住进度。" = "Please enable Siri, Dictation, and Accessibility in order, then finally enable Input Monitoring. After setting Input Monitoring, you usually need to quit and reopen; this guide will remember your progress.";
"请先注册登录 AhaType 后再开启云端整理。" = "Please register and log in to AhaType before enabling cloud tidy.";
"请先登录后再充值。" = "Please log in before recharging.";
"请先连接 AhaKey 设备" = "Please connect an AhaKey device first";
"请检查输入权限" = "Please check input permissions";
"请求失败（HTTP %d）。" = "Request failed (HTTP %d).";
"请点「查看日志」检查 %@；并确认系统「隐私与安全性」中已允许本应用使用蓝牙；若通过 LaunchAgent 拉起 agent 子进程，也需为同一签名的二进制授权。" = "Tap \"View Logs\" to check %@; also confirm the system \"Privacy & Security\" allows this app to use Bluetooth. If the agent subprocess is launched via LaunchAgent, the binary with the same signature must also be authorized.";
"请直接拨动键盘上的物理拨杆切换；`/yolo` 不会覆盖拨杆。" = "Please toggle the physical switch on the keyboard directly; `/yolo` will not override the switch.";
"请确认 LaunchAgent 里 ahakeyconfig-agent 在跑、且蓝牙已选「由 Agent 占用」并连上键盘。\n" = "Please confirm that ahakeyconfig-agent is running in LaunchAgent, and that Bluetooth is set to \"Occupied by Agent\" and connected to the keyboard.\n";
"请蓝牙连接小键盘后，将光标放在这里，按下麦克风键开始说话" = "After connecting the keyboard via Bluetooth, place the cursor here and press the microphone key to speak";
"请蓝牙连接小键盘后，将光标放在这里，按下麦克风键开始说话。" = "After connecting the keyboard via Bluetooth, place the cursor here and press the microphone key to speak.";
"请输入兑换码。" = "Please enter the redemption code.";
"请输入手机号和密码。" = "Please enter your phone number and password.";
"请输入账号密码重新登录。" = "Please enter your account and password to log in again.";
"请重试或检查语音权限" = "Please retry or check voice permissions";
"请靠近麦克风重试" = "Please move closer to the microphone and retry";
"读配置 0x01" = "Read Config 0x01";
"读配置 0x03" = "Read Config 0x03";
"读配置 0x05" = "Read Config 0x05";
"调用苹果原生语音转写，识别完成后以 ⌘V 写回当前光标位置。适合 Claude Code、Kimi Code、Codex 等 CLI 终端及任意输入框。按一次开始，再按一次结束。" = "Use Apple native voice transcription; after recognition, paste back to the current cursor position with ⌘V. Suitable for Claude Code, Kimi Code, Codex and other CLI terminals, as well as any input field. Press once to start, press again to stop.";
"豆包输入法" = "Doubao Input Method";
"豆包输入法 Mac 版需要直接接收真实语音键事件。AhaKey Studio 会切到豆包输入源，并把 F18 配置为豆包长按语音快捷键；按住语音键说话，松开后由豆包提交文字。" = "The Mac version of Doubao Input Method needs to receive real voice key events directly. AhaKey Studio will switch to the Doubao input source and configure F18 as Doubao's long-press voice shortcut; hold the voice key to speak, and release to submit text via Doubao.";
"豆包需要真实 F18 长按事件；已切到豆包输入源并配置长按 F18，请用实体语音键测试。" = "Doubao requires a real F18 long-press event; the input source has been switched to Doubao and long-press F18 configured. Please test with the physical voice key.";
"账号请求失败。" = "Account request failed.";
"超过固件单键宏 98 字节 / 49 步上限，同步时会被拒绝。" = "Exceeds the firmware single-key macro limit of 98 bytes / 49 steps; will be rejected during sync.";
"跳过" = "Skip";
"转写权限" = "Transcription Permission";
"转写测试" = "Transcription Test";
"转写测试在哪" = "Where is the Transcription Test";
"软件覆盖拨杆" = "Software Override Switch";
"辅助功能" = "Accessibility";
"输入方式" = "Input Method";
"输入监控" = "Input Monitoring";
"输入监控 %@ · 辅助功能 %@ · 检查于 %@" = "Input Monitoring %@ · Accessibility %@ · Checked at %@";
"达到最大合盖保护时长，已自动释放 L3" = "Max lid-close duration reached; L3 automatically released";
"运行中" = "Running";
"返回" = "Back";
"还没有选择图片" = "No image selected yet";
"还缺%@权限。请先在系统设置里打开后，再按一次语音键。" = "Missing %@ permission. Please enable it in System Settings, then press the voice key again.";
"还缺系统权限：请为 AhaKey Studio 打开“输入监控”和“辅助功能”，授权后回到软件点“重新检查权限”。" = "Still missing system permissions: please enable \"Input Monitoring\" and \"Accessibility\" for AhaKey Studio, then return to the app and tap \"Recheck Permissions\".";
"还缺苹果原生语音权限，请先打开麦克风、语音转写、Siri 与听写。" = "Still missing Apple native voice permissions: please enable Microphone, Voice Transcription, Siri, and Dictation first.";
"这会立即释放所有合盖运行断言和虚拟显示器。" = "This will immediately release all lid-close running assertions and the virtual display.";
"这里会显示实时识别或最近写入的内容。" = "Live recognition or the most recently inserted text will appear here.";
"这里使用软件内同一套语音链路测试，不再只是展示授权状态。" = "This uses the same in-app voice pipeline for testing, not just showing authorization status.";
"这里展示的是你刚选中的图片文件。" = "This shows the image file you just selected.";
"进入工作台" = "Enter Studio";
"连接" = "Connection";
"连接与控制" = "Connection & Control";
"连接中…" = "Connecting…";
"连接失败" = "Connection Failed";
"连接设备" = "Connect Device";
"连接超时，本次未写入键盘；已释放蓝牙给 Agent，可再次进入编辑后重试保存。" = "Connection timed out; keyboard was not written this time. Bluetooth has been released to the Agent; you can re-enter editing and try saving again.";
"退出 AhaKey Studio" = "Quit AhaKey Studio";
"退出并重新打开" = "Quit and Relaunch";
"退出并重新打开…" = "Quit and Relaunch…";
"退出登录" = "Log Out";
"适合批准、确认、继续执行这类高频动作。" = "Suitable for high-frequency actions like approve, confirm, and continue.";
"适合拒绝、取消、停止这类相反动作。" = "Suitable for opposite actions like reject, cancel, and stop.";
"选择 GIF 或图片" = "Choose GIF or Image";
"选择图片" = "Select Image";
"通信日志" = "Communication Log";
"通知" = "Notifications";
"通知 Agent 设置 userSwitchOverride" = "Notify Agent to Set userSwitchOverride";
"通知特征(0x7344) 已订阅" = "Notification characteristic (0x7344) subscribed";
"通知通道已订阅" = "Notification channel subscribed";
"部分完成：键位与灯效已写入，但有 %d 张图片未写入（%@）。其余图片不受影响，可再次点击写入仅重试这些图片。" = "Partially complete: key and lighting configs written, but %d images were not written (%@). The remaining images are unaffected; tap Write again to retry only those images.";
"配置层仅影响新启动的 Kimi 会话；已运行会话请用 /yolo on/off 切换，或关闭后重新启动。PreToolUse 仍仅 deny 会拦工具。" = "The config layer only affects newly launched Kimi sessions; for open sessions use /yolo on/off, or close and restart. PreToolUse still only blocks tools on deny.";
"配置已成功写入键盘。" = "Configuration successfully written to keyboard.";
"重新打开 AhaKey Studio 新手引导" = "Reopen AhaKey Studio Onboarding";
"重新检查" = "Recheck";
"重新检查权限" = "Recheck Permissions";
"重新连接设备" = "Reconnect Device";
"重置中…" = "Resetting…";
"重置失败:\n普通模式: %@\nsudo模式: %@" = "Reset failed:\nNormal mode: %@\nsudo mode: %@";
"重置并授权" = "Reset and Authorize";
"重置并重启" = "Reset and Restart";
"针对 Claude Code 终端权限菜单：Key2 直接输入 Y（同意），Key3 直接输入 N（拒绝）。" = "For Claude Code terminal permission menu: Key2 directly inputs Y (approve), Key3 directly inputs N (reject).";
"针对 Codex 终端审批：Key2 发送 ↵ 确认，Key3 发送 Esc 取消。" = "For Codex terminal approval: Key2 sends ↵ to confirm, Key3 sends Esc to cancel.";
"针对 Cursor Composer / Agent：Key2 发 ↵、Key3 发 ⌫（与裸键一致）。" = "For Cursor Composer / Agent: Key2 sends ↵, Key3 sends ⌫ (same as bare key).";
"键位/灯效已保存；有 %d 张图片未写入：%@。其余图片不受影响，可再次点击写入仅重试这些图片。" = "Key/lighting config saved; %d images were not written: %@. The remaining images are unaffected; tap Write again to retry only those images.";
"键盘已连接" = "Keyboard Connected";
"键盘已连接；正在同步 Agent 连接状态" = "Keyboard connected; syncing Agent connection status";
"键盘控制中" = "Keyboard Control";
"键盘连接已中断，当前图片写入已停止。请重连后继续。" = "Keyboard connection was interrupted and image writing has stopped. Please reconnect and continue.";
"键码" = "Key Code";
"长按" = "Long Press";
"长按绑定不同快捷键需固件升级后生效，当前仅短按绑定会写入设备。" = "Long-press binding for different shortcuts requires a firmware upgrade to take effect; currently only short-press bindings are written to the device.";
"防止电脑进入睡眠" = "Prevent Computer Sleep";
"阻止空闲休眠" = "Prevent idle sleep";
"需 macOS 14 或更高版本" = "Requires macOS 14 or later";
"需固件支持" = "Requires Firmware Support";
"需清除" = "Needs Clear";
"需要先安装 Agent" = "Agent Required";
"需要固件 v2+ 支持" = "Requires firmware v2+ support";
"需要安装 Agent 后才能控制键盘" = "Agent must be installed before controlling the keyboard";
"需要重启" = "Restart Required";
"需要重启以刷新权限" = "Restart required to refresh permissions";
"需要重置语音识别权限才能继续。点击「重置」后需重启应用才能重新授权。" = "Voice recognition permission must be reset to continue. After tapping \"Reset\", the app must be restarted to re-authorize.";
"需要重置麦克风权限才能重新授权。" = "Microphone permission must be reset to re-authorize.";
"预览到键盘" = "Preview to Keyboard";
"预览动图" = "Preview Animation";
"预览图片" = "Preview Image";
"预览：%@" = "Preview: %@";
"预设对应快捷键：Typeless/微信语音/豆包输入法内仍选 Fn/Globe。本 Studio 使用 F19 作为 Fn 触发键；按下后向系统注入「按住 Fn」。旧版 F18 仍会兼容监听。请授予输入监控与辅助功能。" = "Preset shortcut: in Typeless / WeChat Voice / Doubao Input Method, still select Fn/Globe. This Studio uses F19 as the Fn trigger key; when pressed, it injects \"hold Fn\" into the system. The legacy F18 will still be monitored for compatibility. Please grant Input Monitoring and Accessibility permissions.";
"预设方案" = "Presets";
"颜色对照表" = "Color Reference Table";
"首次连接，可以先打开「权限诊断」过一遍权限项；任何 Hook 不生效的问题大多在权限里。" = "For first connection, you can open \"Permission Diagnosis\" to go through the permission items; most issues where hooks don't work are related to permissions.";
"麦克风" = "Microphone";
"麦克风 %@ · 语音转写 %@ · Siri %@ · 听写 %@ · 检查于 %@" = "Microphone %@ · Speech Recognition %@ · Siri %@ · Dictation %@ · Checked at %@";
"麦克风 + 输入监控 + 辅助功能三个权限都得给。打开「权限诊断」可以一键跳到系统设置对应页。" = "Microphone + Input Monitoring + Accessibility permissions are all required. Open \"Permission Diagnosis\" to jump to the corresponding system settings page with one tap.";
"麦克风权限已自动重置，下次点击「申请」按钮时会弹出系统授权对话框。" = "Microphone permission has been reset. The system authorization dialog will appear the next time you click Apply.";
"麦克风权限已被拒绝" = "Microphone permission denied";
"麦克风权限已重置" = "Microphone permission reset";
"麦克风权限已重置（使用 sudo）" = "Microphone permission reset (using sudo)";
"默认 Backspace，可改任意短按 / 长按。" = "Default Backspace; can be changed to any short press / long press.";
"默认动图" = "Default Animation";
"默认图片" = "Default Image";
"默认图片（连接即自动同步）" = "Default Image (auto-syncs on connection)";
"默认效果是来回流水灯。" = "Default effect is a back-and-forth flowing light.";
"默认用红色常亮停住。" = "Defaults to a steady red light to stop.";
"（AhaType 总开关已关闭）" = "(AhaType master switch is off)";
"（switchState 缺省：批准链可能仍交回手动；请把「蓝牙」交给 Agent 并连上键盘。）" = "(switchState default: approval chain may still be returned to manual; please hand over \"Bluetooth\" to the Agent and connect the keyboard.)";
"（存在但无法解析为 JSON：%@）" = "(Exists but cannot be parsed as JSON: %@)";
"（存在但无法读取：%@）" = "(Exists but cannot be read: %@)";
"（拨杆非 0：PermissionRequest 将交回终端手动确认）" = "(Switch is non-zero: PermissionRequest will be returned to the terminal for manual confirmation)";
"（文件不存在：%@）\n\n可先点「安装 Codex Hooks」创建并合并 `[features].hooks` 与 AhaKey hook block。" = "(File does not exist: %@)\n\nYou can tap Install Codex Hooks to create and merge `[features].hooks` with the AhaKey hook block.";
"（文件不存在：%@）\n\n可先点「安装 Cursor Hooks」生成或合并；若只使用**项目内** `.cursor/hooks.json`，本路径仍可能为空。" = "(File does not exist: %@)\n\nYou can tap Install Cursor Hooks to generate or merge; if you only use a project-level `.cursor/hooks.json`, this path may remain empty.";
"（文件不存在：%@）\n\n可先点「安装 Kimi Hooks」创建并写入 AhaKey 标记块；须已安装并使用 Kimi Code CLI：https://moonshotai.github.io/kimi-cli/" = "(File does not exist: %@)\n\nYou can tap Install Kimi Hooks to create and write the AhaKey marker block; requires Kimi Code CLI installed and in use: https://moonshotai.github.io/kimi-cli/";
"（文件不存在：%@）\n\n可点诊断面板中「合并 Shell 白名单 + approvalMode=auto」从空白创建；或自行在文档中按 `permissions` 配置。" = "(File does not exist: %@)\n\nYou can tap Merge Shell Allowlist + approvalMode=auto in the diagnostics panel to create from scratch, or configure `permissions` yourself according to the docs.";
"（无输出）" = "(No output)";
"（无输出，退出非 0）" = "(No output, exit code non-zero)";

/* Speech recognition language picker */
"识别语言" = "Recognition language";
"未选择时跟随 macOS 系统语言。" = "When nothing is selected, follows the macOS system language.";
"粤语（香港）" = "Cantonese (Hong Kong)";
"中文（香港）" = "Chinese (Hong Kong)";
"普通话（简体）" = "Mandarin (Simplified)";
"国语（繁体）" = "Mandarin (Traditional)";
"粤语（内地）" = "Cantonese (Mainland)";
